-- NetHack quest.lua $NHDT-Date: 1726894904 2024/09/21 05:01:44 $  $NHDT-Branch: NetHack-3.7 $:$NHDT-Revision: 1.10 $
-- Copyright (c) 2021 by Pasi Kallinen
-- NetHack may be freely redistributed.  See license for details.
-- TODO:
--  - output = "verbalize"
--  - export the quest string replacements to lua, instead of %H etc
--  - allow checking if hero is carrying item (see comments for %Cp Arc 00042)
--  - fold quest_portal, quest_portal_again, quest_portal_demand into one
--  - write tests to check questtext validity?
--  - qt_pager hack(?): if (qt_msg->delivery == 'p' && strcmp(windowprocs.name, "X11"))




-- text = "something"
-- Text is shown to the user.

-- synopsis = "something"
-- Synopsis is inserted into the message history.
--
-- output = "pline" | "menu" | "text"
-- The output can be manually set by using output = "menu"
-- Valid values for output are "pline", "text", and "menu, defaulting to
-- pline, unless the text contains newlines, or is too long to fit a message buffer,
-- then will be shown as a text window instead.



questtext = {
   -- If a role doesn't have a specific message, try a fallback
   msg_fallbacks = {
      goal_alt = "goal_next"
   },
   common = {
      TEST_PATTERN = {
         output = "text",
         text = [[%p:   return(plname);
 %c:  return(pl_character);
 %r:  return((char *)rank_of(u.ulevel));
 %R:  return((char *)rank_of(MIN_QUEST_LEVEL));
 %s:  return((flags.female) ? "sister" : "brother" );
 %S:  return((flags.female) ? "daughter" : "son" );
 %l:  return((char *)ldrname());
 %i:  return(intermed());
 %o:  return(artiname());
 %O:  return(shortened(artiname()));
 %n:  return((char *)neminame());
 %g:  return((char *)guardname());
 %G:  return((char *)align_gtitle(u.ualignbase[1]));
 %H:  return((char *)homebase());
 %a:  return(Alignnam(u.ualignbase[1]));
 %A:  return(Alignnam(u.ualign.type));
 %d:  return((char *)align_gname(u.ualignbase[1]));
 %D:  return((char *)align_gname(A_LAWFUL));
 %C:  return("chaotic");
 %N:  return("neutral");
 %L:  return("lawful");
 %x:  return((Blind) ? "sense" : "see");
 %Z:  return("TheDungeonsofDoom");
 %%:  return(percent_sign);
 asuffix:   returnan(root);
 Asuffix:   returnAn(root);
 Csuffix:   returncapitalized(root);
 hsuffix:   returnpronoun(he_or_she, mon_of(root)); /* for %l,%n,%d,%o */
 Hsuffix:   returncapitalized(pronoun(he_or_she, mon_of(root)));
 isuffix:   returnpronoun(him_or_her, mon_of(root));
 Isuffix:   returncapitalized(pronoun(him_or_her, mon_of(root)));
 jsuffix:   returnpronoun(his_or_her, mon_of(root));
 Jsuffix:   returncapitalized(pronoun(his_or_her, mon_of(root)));
 psuffix:   returnmakeplural(root);
 Psuffix:   returnmakeplural(capitalized(root));
 ssuffix:   returns_suffix(root);
 Ssuffix:   returns_suffix(capitalized(root));
 tsuffix:   returnstrip_the_prefix(root);]],
      },
      angel_cuss = {
         "\"汝其悔罪, 则可得赎! \"",
         "\"汝当为无礼受罚! \"",
         "\"吾儿, 汝不日将面见造主. \"",
         "\"至高%D遣我, 令汝为罪受罚! \"",
         "\"%D之怒, 已降于汝! \"",
         "\"汝命今属%D矣! \"",
         "\"愿受此临终之祝乎? \"",
         "\"汝不啻一无神之虚空耳. \"",
         "\"求彼符事, 汝何堪之? \"",
         "\"孰料西班牙宗教裁判所竟至? \"",
         "\"汝之罪决已定, %p. \"",
         "\"汝之清算在即, %p. \"",
         "\"汝当因罪解于%D座前! \"",
         "\"%D在上, 吾将击汝使伏. \"",
      },
      banished = {
         synopsis = "[因你背叛了%d的盟约, 你被从%H中\'逐了出来. ]",
         output = "text",
         text = [["你背叛了所有效忠于%d者, 就像你曾经那样.
我对%d的忠诚坚定不移. 我无法宽恕或接受你所
做的一切.

离开此地. 你永远不得再踏足%H.
你所追寻之物已永远失去, 因为没有开启之钟,
你将永远无法进入持有护身符者
的巢穴.

现在就走! 你已被逐出此地. ]],
      },
      demon_cuss = {
         "\"初见汝时, 以为偶人也 -- 及察, 诚石首耳. \"",
         "\"数临此乎? \"",
         "\"痛, 汝悦之乎? 其欲鞭笞乎? \"",
         "\"吾裂尔肺, 尔以为痒乎? \"",
         "\"啖黏液而死! \"",
         "\"往召尔母! 吾待焉. \"",
         "\"往与独角兽为独角戏! \"",
         "\"饮酒邪? 抑素来拙邪? \"",
         "\"今但笞汝, 后毋尔为. \"",
         "\"吾见酸液怪, 智与色皆胜汝. \"",
         "\"视之! 汝鞋带松矣! \"",
         "\"饶命! 汝欲吾笑死乎? \"",
         "\"速去! 全生以俟后遁! \"",
         "\"尔战宜胜尔衣! \"",
         "\"较汝与尔从昆弟, 美杜莎犹妍. \"",
         "\"吾观汝于彼尸有异动, 信乎, 贱人? \"",
         "\"且以胶管贯汝鼻! \"",
         "\"诚哉, 汝尸之臭无以复加! \"",
         "\"少待! 吾当化形为电子虫, 以资尔一战之力! \"",
         "\"曷求彼符? 汝必失之, 竖子. \"",
         "\"汝宜为俳倡, 技何可笑. \"",
         "\"尔目洞然, 吾以为浮眼! \"",
         "\"尔首, 夺心魔弗啮也! \"",
         "\"惟镜中影爱汝! \"",
         "\"尔尝思掩尔秽乎? \"",
         "\"止! 尔面乃极刑! \"",
         "\"吾当向汝泄气, 恐反令汝香! \"",
      },
      legacy = {
         synopsis = "[%dC已选中你为%dI取回岩德护身符. ]",
         output = "menu",
         text = [[%d之书里这样写道:

    创世之后, 残暴之神摩洛背叛了创世神马尔杜克
    的权威. 摩洛从马尔杜克手中窃取了众神中最强
    大的神器 -- 岩德护符, 并将它藏匿于地狱的幽
    暗洞穴之中, 如今他正潜伏于此, 伺机而动.

你的%G%d企图夺取这枚护身符, 并借此获得
理应属于他的神权, 凌驾于其他诸神之上. 

你, 一位新近受训的%r, 自出生起便被预言为
%G%d的器具. 你注定要为你的神夺回护符, 
否则便死于尝试之中. 命运的时刻已然降临. 为了
我们所有人: 与%d一同勇敢前行吧!
]],
      },
-- starting with 'pauper' option set, last paragraph differs from normal legacy
      pauper_legacy = {
         synopsis = "[%dC已选中你为%dI取回岩德护身符. ]",
         output = "menu",
         text = [[%d之书里这样写道:

    创世之后, 残暴之神摩洛背叛了创世神马尔杜克
    的权威. 摩洛从马尔杜克手中窃取了众神中最强
    大的神器 -- 岩德护符, 并将它藏匿于地狱的幽
    暗洞穴之中, 如今他正潜伏于此, 伺机而动.

你的%G%d企图夺取这枚护身符, 并借此获得
理应属于他的神权, 凌驾于其他诸神之上. 

你, 一位未经训练的%r, 未能充分准备好成为
%G%d的器具. 尽管如此, 你仍注定要为你的神
夺回护符, 否则便死于尝试之中. 命运的时刻已然
降临. 为了我们所有人: 与%d一同勇敢前行吧! ]],
      },
      quest_complete_no_bell = {
         text = [["%n掉落的那枚银铃对寻找岩德护符将起到至关重要的作用."]],
      
      },
      quest_portal = {
         output = "pline",
         text = [[你微弱地心灵感应到了%l的消息:
%H急需你的帮助!
我在等一个... 的人传送过来.
你没能完全听清最后那句话. ]],
      },
      quest_portal_again = {
         text = "你再次感受到%l在求救.",
      },
      quest_portal_demand = {
         text = "你再次感受到%l需求你的参与.",
      },
   },
   Arc = {
      assignquest = {
         synopsis = "[%nC偷走了%o. 找到%i, 打败%ni, 然后把%O还回来. ]",
         output = "text",
         text = [["学院遭遇了不幸, 因为%na
偷走了%o. 没有它, 大学的董事会
很快将别无选择, 只能撤销我们的研究经费.

\"你必须找到通往%i的入口. 在它里面,
你会找到%n.

\"然后你必须击败%n并将%o
归还给我.

\"只有这样, 我们才能阻止可能导致
这所学院关闭的预算削减.

\"愿%d的智慧指引你. \"]],
      },
      badalign = {
         synopsis = "[\"%pC, 你已经偏离了%a之路. 净化你自己! \"]",
         output = "text",
         text = [["%pC! 我听说你一直在使用马虎的技术. 你
最近的结果简直不配称为%ra!

\"你怎么能偏离%a之路? 离开这里, 只有
当你净化了自己之后再回来. \"]],
      },
      badlevel = {
         synopsis = "[%pC, 一个区区%r太缺乏经验了. ]",
         output = "text",
         text = [["%p, 你还太缺乏经验, 无法承担如此苛刻的
任务. 一个区区%r不可能面对所需的要求并
幸存下来. 出发吧, 当你的冒险进一步
教会你之后再来这里. \"]],
      },
      discourage = {
         "\"尽力吧, %p. 你无法击败我. \"",
         "\"我会在你还在呼吸时撕下你身上的肉! \"",
         "\"先是你, %p, 然后我会摧毁你的导师%l. \"",
         "\"累了吗, %p? 我从我的主人那里汲取力量, 绝不会动摇! \"",
         "\"我会将你的灵魂从身体中撕裂并吞噬! \"",
         "\"你太%a了--这削弱了你. 你会死在这里. \"",
         "\"%d已经抛弃了你! 你现在完蛋了! \"",
         "\"区区%r不可能希望击败我! \"",
         "\"如果%l能派出的最好的人是你, 那我就没什么好怕的. \"",
         "\"去死吧%c! 我会把你的尸体作为战利品展出. \"",
      },
      encourage = {
         "\"小心, %n既强大又狡猾. \"",
         "\"要找到通往%i的入口, 你必须经过许多陷阱. \"",
         "\"%nt可能容易受到魔法寒冷的攻击. \"",
         "\"当你遇到%n时, 呼唤%d. \"",
         "\"你必须摧毁%n. 否则它会追杀你. \"",
         "\"%oC是一件强大的护符. 有了它你可以摧毁%n. \"",
         "\"带着%d的祝福前进吧. \"",
         "\"我会让我的%gP们留意你的归来. \"",
         "\"记住不要偏离真正的%a之路. \"",
         "\"当你靠近时, 你也许能感知到%o. \"",
      },
      firsttime = {
         synopsis = "[你到达%H, 但一切并不顺利. ]",
         output = "text",
         text = [[你突然置身于熟悉的环境中. 远处的建筑
似乎是你母校的建筑, 但有些不对劲. 感觉
好像最近发生了一场骚乱, 或者%H
遭到了围攻.

所有的窗户都用木板封住了, 入口周围
散落着各种物品.

奇怪的吓人身影似乎正在远处移动. ]],
      },
      goal_alt = {
         text = "你已经回到了%n的巢穴.",
      },
      goal_first = {
         synopsis = "[这奇怪的感觉一定是%o的存在. ]",
         output = "text",
         text = [[一种奇怪的感觉冲刷着你, 你回想起在%l的
许多讲座中学到的东西.

你意识到这种感觉一定是%o的存在. ]],
      },
      goal_next = {
         text = "%o的熟悉存在感在以太中.",
      },
      gotit = {
         synopsis = "[%o的力量流过你的身体! 你必须把它还给%l. ]",
         output = "text",
         text = [[%o的力量流过你的身体! 你感觉
仿佛现在就能单挑岩德巫师本人并获胜, 但
你知道必须将%o归还给%l. ]],
      },
      guardtalk_after = {
         "\"你前几天晚上看了拉什·拉鲁的'旧怀俄明之歌'吗? \"",
         "\"嘿, 伙计, 有没有幻觉药水卖? \"",
         "\"我猜你现在肯定能当上正教授了. \"",
         "\"那么, 哪个更糟, %n还是你的入学考试? \"",
         "\"%oC令人印象深刻, 但比不上我挖出的骨头! \"",
      },
      guardtalk_before = {
         "\"你前几天晚上看了拉什·拉鲁的'旧怀俄明之歌'吗? \"",
         "\"嘿, 伙计, 有没有幻觉药水卖? \"",
         "\"你看到%l上次挖掘带回的神器了吗? \"",
         "\"那你觉得我们是从哪个物种进化来的? \"",
         "\"所以你就是%l的得意门生! 我不知道他看上了你哪一点. \"",
      },
      hasamulet = {
         synopsis = "[把护身符带到星界, 在%d的祭坛上献祭它. ]",
         output = "text",
         text = [["恭喜, %p. 我曾怀疑是否有人能战胜
岩德巫师和摩洛的仆从. 现在, 你必须开始
最后一场冒险.

\"带上护身符, 找到通往星界的方法.
在那里你必须找到%d的祭坛, 并在
那个祭坛上献祭护身符, 以完成你的命运.

\"记住, 从现在起你的路应该始终向上. \"]],
      },
      killed_nemesis = {
         text = "%n的身体化作一团有毒烟雾消散.",
      },
      leader_first = {
         synopsis = "[\"你回来了, %p, 去面对一个艰巨的任务. \"]",
         output = "text",
         text = [["你终于回来了, %p. 你一直是我
最有前途的学生. 让我看看你是否准备好迎接
你职业生涯中最艰巨的任务. \"]],
      },
      leader_last = {
         synopsis = "[\"%pC, 你辜负了我们. 滚开! \"]",
         output = "text",
         text = [["%p, 你辜负了我们. 我所有的精心培养都
白费了. 滚开! 你在本学院的教职已被撤销!

\"你是这个行业的耻辱! \"]],
      },
      leader_next = {
         text = [["再次, %p, 你站在我面前.
让我看看你是否在此间隙获得了经验. \"]],
      },
      leader_other = {
         text = [["又一次, %p, 你从野外回来了.
你终于准备好完成必须完成的任务了吗? \"]],
      },
      locate_first = {
         synopsis = "[这座不祥的建筑一定是通往%i的入口. ]",
         output = "text",
         text = [[一片平原展现在你面前. 平原的远处是一座不祥的建筑.

你有种感觉, 你很快就会找到通往
%i的入口. ]],
      },
      locate_next = {
         text = "再一次, 你靠近了%i的入口.",
      },
      nemesis_first = {
         synopsis = "[\"来吧, %p, 我会摧毁你! \"]",
         output = "text",
         text = [["那么, %p, 你认为你能成功找回
%o, 而你的老师%l已经失败了?

\"来吧, 尽全力吧! 我会摧毁你, 然后啃咬你的骨头. \"]],
      },
      nemesis_next = {
         synopsis = "[\"你又想战胜我, %p? 你永远找不回%o. \"]",
         output = "text",
         text = [["你又想战胜我, 嗯%p? 好吧, 你会再次失败.

\"你永远找不回%o.

\"我会把你的灵魂带到起源位面, 供我的主人取乐. \"]],
      },
      nemesis_other = {
         text = "\"你还坚持着, %p! 很好. 现在, 你去死吧! \"",
      },
      nemesis_wantsit = {
         text = [["我会从你那里得到%o, %p, 然后
享用你的内脏! \"]],
      },
      nexttime = {
         text = "又一次, 你回到了%H.",
      },
      offeredit = {
         synopsis = "[%lC指示你从现在起守护%o. ]",
         output = "text",
         text = [[%lC短暂地触摸%o, 凝视着它,
然后对你微笑说道:

\"干得好, %p. 你击败了%n并
找回了%o. 但我担心它在这里
永远不会安全.

\"请带上%o. 你, %p, 现在
可以比我更好地守护它.

\"愿%d的祝福跟随你并保护你. \"]],
      },
      offeredit2 = {
         synopsis = "[\"通过通往%Z的魔法传送门, 继续寻找护身符. \"]",
         output = "text",
         text = [["小心, %p! %oC可能会碎, 那将是
一个悲剧性的损失. 你现在是它的守护者, 是时候
继续寻找护身符了. %Z正通过
带你来到这里的魔法传送门等待你的归来. \"]],
      },
      othertime = {
         text = [[你回到了%H.
你有一种奇怪的感觉, 这可能是你最后一次来这里. ]],
      },
      posthanks = {
         synopsis = "[\"你在为%d重夺岩德护身符的任务中取得进展了吗? \"]",
         output = "text",
         text = [["欢迎回来, %p. 你在为%d重夺
岩德护身符的任务中取得进展了吗? \"]],
      },
   },
   Bar = {
      assignquest = {
         synopsis = "[\"找到%n, 击败%ni, 并把%o归还给我们. \"]",
         output = "text",
         text = [["世界迫切需要你的帮助, %p.

\"大约六个月前, 我得知一个神秘的巫师,
名叫%n, 开始在%ni周围聚集一大群
暴徒和强盗.

\"大约在同一时间, 你曾经一起骑马的那些人从
一个图兰商队中\'解放\'了一个强大的魔法护身符,
%o.

\"%nC和%nj的黑潮席卷了%i,
击败了那里的人, 把他们赶进了沙漠. 他拿走了
%o, 并试图将其屈从于%nj意志. 我察觉到了
命运之流中的微妙变化, 并加入了这些人.
然后我发出了召唤你的讯息.

\"如果%n能将%o屈从于%nj意志, 他将变得
几乎不可摧毁. 然后他将能够奴役全世界
人们的思想. 你是唯一的希望. 众神对你微笑,
有%d在你身后, 只有你能击败%n.

\"你必须去%i. 从那里, 你可以追踪
%n, 击败%ni, 并将%o归还给我们. 只有
那时世界才会安全. \"]],
      },
      badalign = {
         synopsis = "[\"你已经偏离了%a之路. 等你赎罪之后再回来. \"]",
         output = "text",
         text = [["%pC! 你已经偏离了%a之路!
如果你在这种状态下试图击败%n, 他必定会
奴役你的灵魂. 你唯一的希望, 也是我们的希望, 在于你的净化.
出发吧, 当你感觉准备好了再回来. \"]],
      },
      badlevel = {
         synopsis = "[\"你太缺乏经验了. 等你成为%Ra之后再回来. \"]",
         output = "text",
         text = [["%p, 我担心你还太缺乏经验, 无法面对
%n. 只有%Ra在%d的帮助下才有希望
击败%ni. \"]],
      },
      discourage = {
         "\"今晚我的宠物会享用你的尸体! \"",
         "\"你是个可怜的%ra. \"",
         "\"趁还能跑, 快跑吧, %c. 我的下一个法术将是你的末日. \"",
         "\"我会用你的皮肤来装订我的下一本魔法书. \"",
         "\"%d现在保护不了你了. 在这里, 你死定了. \"",
         "\"你的%a本性使你软弱. 你无法击败我. \"",
         "\"来吧, %c. 我会杀了你, 然后把我的部落放出来干掉你的部落. \"",
         "\"一旦你死了, 我的部落就会干掉%l, 还有你的部落. \"",
         "\"战斗吧, %c, 还是你害怕强大的%n? \"",
         "\"你失败了, %c. 现在, 我的胜利完整了. \"",
      },
      encourage = {
         "\"%nC在黑魔法上很强, 但对冷钢并非免疫. \"",
         "\"记住%n是个伟大的巫师. 他生活在亚特兰蒂斯时代. \"",
         "\"如果你失败了, %p, 我将无法长久保护这些人. \"",
         "\"要进入%i, 你必须非常隐秘. 部落会保持警惕. \"",
         "\"在你需要的时候呼唤%d. \"",
         "\"愿%d保护你, 指引你的脚步. \"",
         "\"如果你能拿到%o, 就带着它求好运. \"",
         "\"我无法抵挡%n的巫术. 但%d会帮助你. \"",
         "\"不要害怕%n. 我知道你能击败%ni. \"",
         "\"你还有很长的路要走, %p, 但只有在你击败%n之后. \"",
      },
      firsttime = {
         synopsis = "[你到达%H附近, 但感觉到附近有邪恶魔法. ]",
         output = "text",
         text = [[你警惕地扫视四周, 所有感官都警觉起来, 寻找
可能的危险迹象. 在远处, 你可以%x到%H
熟悉的外形.

但你想, 为什么%l会在那里?

突然, 你脖子后面的汗毛竖了起来, 因为你察觉到了
空气中邪恶魔法的光环.

想都没想, 你握紧了武器, 低声说道:

    \"以%d之名, 今天必将流血. \"]],
      },
      goal_first = {
         synopsis = "[这里肯定是%n的巢穴. ]",
         output = "text",
         text = [[你颈后的毛发竖了起来, 因为你感觉到
周围空气中有一股能量. 你抑制住一种原始的恐慌, 它试图
让你转身逃跑. 这里肯定是%n的巢穴. ]],
      },
      goal_next = {
         text = "你又感觉到周围的空气中弥漫着恶意的魔法能量.",
      },
      gotit = {
         synopsis = "[你感觉到%o的力量流过你的双手. ]",
         output = "text",
         text = [[当你拿起%o时, 你感觉到它的力量
流过你的双手. 它似乎同时存在于两个或更多
地方, 尽管你正拿着它. ]],
      },
      guardtalk_after = {
         "\"这里的战斗很激烈--敌人的鲜血浸透了土壤! \"",
         "\"记住, 荣耀就是把敌人踩在脚下! \"",
         "\"现在敌军被击败了, 好日子会回来的. \"",
         "\"你击败%n, 为我们的氏族带来了极大的荣誉. \"",
         "\"你将配得上做%l的继承人. \"",
      },
      guardtalk_before = {
         "\"这里的战斗很激烈--敌人的鲜血浸透了土壤! \"",
         "\"记住, 荣耀就是把敌人踩在脚下! \"",
         "\"自从部落到来后, 就没什么财宝可掠夺了. \"",
         "\"部落人数众多, 但没什么勇气. \"",
         "\"%lC是个奇怪的家伙, 但他帮助保卫了我们. \"",
      },
      hasamulet = {
         synopsis = "[\"把护身符带到星界%d的祭坛上并献上它. \"]",
         output = "text",
         text = [["这太不可思议了, %p. 我担心你不可能
在你的任务中成功, 但你现在却拥有了
岩德的护身符!

\"自从你离开后, 我一直在不断研究法师的文本. 在
斯凯洛斯之书中, 我找到了这个:

    %d将让一个孩子被送到这个世界上. 这个孩子将通过
    战斗和魔法的考验变得坚强, 因为%d如此意愿.
    据说%d的孩子将找回
    创世之初被偷走的岩德护身符.

\"既然你现在拥有了护身符, %p, 我怀疑这本书
说的是你.

    %d的孩子将带上护身符, 前往星界
    位面, 在那里可以找到%d的大神殿. 护身符
    将在那里献给%d, 就在%dJ祭坛上. 然后孩子将
    作为所有%cP的勇士永远站在%d身边.

\"这就是我所知道的, %p. 我希望它能帮助你. \"]],
      },
      killed_nemesis = {
         synopsis = "[%nC诅咒你, 但你感觉到空气中压倒性的魔法光晕正在消退. ]",
         output = "text",
         text = [[%nC倒在地上, 向你发出最后的诅咒. 然后%nj
身体慢慢消散, 似乎散入了你周围的空气. 你
慢慢意识到空气中压倒性的魔法光晕已经
开始消退. ]],
      },
      leader_first = {
         synopsis = "[\"你终于回来了. 有一个伟大的任务你必须承担. \"]",
         output = "text",
         text = [["啊, %p. 你终于回来了. 世界迫切需要
你的帮助. 有一个伟大的任务你必须承担.

\"但首先, 我必须看看你是否准备好迎接这样的挑战. \"]],
      },
      leader_last = {
         synopsis = "[\"你背叛了%d; 很快%n就会摧毁我们. 滚开! \"]",
         output = "text",
         text = [["呸! 你背叛了众神, %p. 你永远不会获得
你渴望的荣耀. 你未能遵循正确的道路已经
为你关闭了这未来.

\"我会尽力保护这些人, 但很快%n就会
击败我, 摧毁所有曾经称你为%s的人. 现在滚开! \"]],
      },
      leader_next = {
         text = "\"%p, 你回来了. 你现在准备好迎接挑战了吗? \"",
      },
      leader_other = {
         text = "\"你又站在我面前了, %p. 想必你已经准备好了. \"",
      },
      locate_first = {
         synopsis = "[你已经找到了%i. ]",
         output = "text",
         text = [[沙漠的微风中传来水的气息. 你知道
你已经找到了%i. ]],
      },
      locate_next = {
         text = "你又一次有机会潜入%i.",
      },
      nemesis_first = {
         synopsis = "[%nC吹嘘%nh杀过很多人. \"准备受死吧, %c. \"]",
         output = "text",
         text = [["那么. 这就是那个二流巫师%l派来为他
做事的家伙. 我之前杀过很多人. 你不会给我带来什么乐趣.

\"准备受死吧, %c. \"]],
      },
      nemesis_next = {
         text = "\"我在你身上已经浪费了太多时间. 现在, 你去死吧. \"",
      },
      nemesis_other = {
         text = "\"你又回来了, %c! 你现在准备好受死了吗? \"",
      },
      nemesis_wantsit = {
         text = [["我要拿回%o, 你这可怜的%ca.
还有你的命. \"]],
      },
      nexttime = {
         text = [[又一次, 你接近%H. 你知道%l
会在等待. ]],
      },
      offeredit = {
         synopsis = "[%lC告诉你守护%o, 并在你胜利后归来. ]",
         output = "text",
         text = [[当%l看到%o时, 他笑了, 说道:

    干得好, %p. 你拯救了世界免于必然的毁灭.
    那么, 现在该如何处理%o呢?

    这些人, 尽管勇敢, 却无法希望守护它免于
    其他巫师的侦测, 就像%n一样.

    带上%o吧, %p. 它会在
    你的冒险中保护你, 你也可以最好地守护它. 你正在开始一项
    比你意识到的要伟大得多的任务.

    记住我, %p, 当你胜利时再回来. 我
    到时会告诉你必须做什么. 当时机到来时你会明白的. ]],
      },
      offeredit2 = {
         synopsis = "[\"你留着%o. 回到%Z去寻找护身符. \"]",
         output = "text",
         text = [[%l虔诚地凝视着%o, 然后回到你身上.

\"你现在是它的守护者, 是时候继续寻找
护身符了. %Z正等待你通过
带你来到这里的魔法传送门返回. \"]],
      },
      othertime = {
         text = [[又一次, 而且你认为可能是最后一次, 你接近了
%H.]],
      },
      posthanks = {
         text = "\"告诉我们, %p, 你伟大的任务进展顺利吗? \"",
      },
   },
   Cav = {
      assignquest = {
         synopsis = "[找到并击败%n, 取回%o, 然后带着它回来. ]",
         output = "text",
         text = [["你现在确实准备好了, %p. 我要告诉你一个关于
你的人民遭受巨大苦难的故事:

\"你离开去进行你的灵视探索后不久, 洞穴就被
%n派来的生物入侵了.

\"她本人由于体型巨大无法攻击我们, 但她的仆从
从那时起就一直骚扰我们. 在最初的袭击中, 许多人死去,
%n的仆从设法偷走了%o.
他们把它带到了%i, 在那里, 我们
%g战士没有一个能去.

\"你必须找到%i, 并在其中从
%n手中夺取%o. 她像
守护她获得的所有财宝一样嫉妒地守护着它. 但有了它,
我们可以再次让我们的洞穴安全.

\"拜托, %p, 为我们找回%o, 并把它带回这里. \"]],
      },
      badalign = {
         synopsis = "[\"你不再遵循%a之路了. 去净化你自己. \"]",
         output = "text",
         text = [["%pC! 你已经偏离了我的教导. 你不再像
你应该做的那样遵循%a之路. 我把你驱逐出这些洞穴,
去净化你自己. 然后, 你或许能够完成这个
任务. \"]],
      },
      badlevel = {
         synopsis = "[\"%rA太缺乏经验了. 等你进步了再回来. \"]",
         output = "text",
         text = [["唉, %p, 你还太缺乏经验, 无法承担
我要交给你的如此艰巨的任务.

\"一个%rA不可能承受找到
%i所需的要求, 更不用说面对%n本人了.

\"多冒险一些, 你会学到所需的技能.
%d注定如此. \"]],
      },
      discourage = {
         "\"你很弱, %c. 对万龙之母来说不是挑战. \"",
         "\"我饿了, %r. 你看起来像一道不错的前菜! \"",
         "\"和我共进午餐吧? 你就是主菜, %c. \"",
         "\"有了%o, 我无敌了! 你不可能成功. \"",
         "\"你的导师%l已经失败了. 你没什么好怕的. \"",
         "\"你会死在这里, %c. %rA不可能希望击败我. \"",
         "\"你, 一个区区%r, 胆敢挑战%n的威严? 哈! \"",
         "\"我是万龙之母! 你别想打败我. \"",
         "\"我的爪子现在很锋利. 我会把你撕成碎片! \"",
         "\"%d抛弃了你, %c. 这是我的领域. \"",
      },
      encourage = {
         "\"%nC对她自己的吐息免疫. 你应该对她使用她自己不用的魔法. \"",
         "\"当你遇到%n时, 呼唤%d寻求帮助. \"",
         "\"在%n的内殿里没有地方可以躲藏. \"",
         "\"对付%n的最佳机会是不断移动. \"",
         "\"不要被%n巢穴里的巨大财宝分心. 专注于%o. \"",
         "\"%oC是%n唯一真正害怕的物品. \"",
         "\"不要被%n的体型愚弄. 她速度很快, 而且传闻她使用魔法. \"",
         "\"我会派一队%gP和你一起去, 但我们需要全部力量来保卫自己. \"",
         "\"记住, 始终保持%a. 这是你的力量. \"",
         "\"要是我们有一面反射护身符就好了, 这样就不会发生这种事了. \"",
      },
      firsttime = {
         synopsis = "[你回到%H, 但这里有些不对劲. ]",
         output = "text",
         text = [[你从一个依稀熟悉的楼梯下来, 记得是%l
在你开始灵视探索时带你走过的.

你回到了%H, 但这里似乎
有些不对劲. 外洞篝火的烟雾和光芒
不见了, 潮湿的空气中充满了不安的寂静. ]],
      },
      goal_first = {
         synopsis = "[你进入一个大洞穴. %nC在场. ]",
         output = "text",
         text = [[你发现自己身处一个大洞穴中, 墙壁被精心打磨,
但仍然显示出被火烧焦的痕迹.

地板上散落着骨头, 到处散落着物品.
空气中弥漫着刺鼻的硫磺味.

%nC清晰可见, 但%nh似乎在睡觉. ]],
      },
      goal_next = {
         text = "又一次, 你发现自己身处%n的巢穴.",
      },
      gotit = {
         synopsis = "[%oC让你充满力量感. ]",
         output = "text",
         text = [[当你拿起%o时, 起初感觉很重, 但当你
握住它时, 力量涌入你的手臂.

你突然感到充满力量, 仿佛没有什么能阻挡
你的道路. ]],
      },
      guardtalk_after = {
         "\"雨水回来了, 土地又变得郁郁葱葱. \"",
         "\"和平恢复了, 感谢%d! \"",
         "\"欢迎回来! 你找到%o了吗? \"",
         "\"那么, %p, 给我们讲讲你和%n战斗的故事吧. \"",
         "\"%lC年事已高. 也许在他升天之后你会领导我们. \"",
      },
      guardtalk_before = {
         "\"自从巨人封锁了我们通往外部世界的通道, 我们就没能收集到那么多食物. \"",
         "\"自从%n派来她的仆从, 我们就一直在战斗. \"",
         "\"我听说你的灵视探索成功了. 是这样吗? \"",
         "\"那么, 告诉我, %p, 你过得怎么样? \"",
         "\"%lC年事已高. 我们不知道在他升天之后谁会领导我们. \"",
      },
      hasamulet = {
         synopsis = "[\"把护身符带到星界%d的祭坛上并献上它. \"]",
         output = "text",
         text = [["你已经成功了, 我看到了, %p.

\"既然岩德的护身符是你的了, 接下来你必须这样做:

\"向上旅行到开阔的天空. 你携带的护身符会
带你进入星界位面, 在那里%d的大神殿
将它的影响投射到我们的整个世界.

\"在祭坛上献祭护身符. 这样%d就能成为至高无上的存在! \"]],
      },
      killed_nemesis = {
         text = [[%nC倒在地上, 她的头四处乱甩.
当她死去时, 一股有毒的烟雾从她身上喷出. ]],
      },
      leader_first = {
         synopsis = "[\"你回来了. 我们急需你的帮助. \"]",
         output = "text",
         text = [["你从灵视探索回来了, %p. 感谢%d.

\"我们急需你的帮助, 我的%S.

\"但首先, 我必须看看你是否还有能力承担
我将要求你承担的任务. \"]],
      },
      leader_last = {
         synopsis = "[\"你背叛了%L. 滚开! \"]",
         output = "text",
         text = [["%pC! 你已经注定了我们的命运. 你似乎无法自我改造,
所以我必须另选他人接替你的位置.

\"从%H滚开! 你选择了
%C之路而非%L的真正之路, 背叛了我们.

\"在我们眼中, 你已经不存在了. \"]],
      },
      leader_next = {
         text = "\"你又回到了我们身边, %p. 让我看看你现在是否准备好了. \"",
      },
      leader_other = {
         text = "\"啊, %p. 你终于准备好了吗? \"",
      },
      locate_first = {
         synopsis = "[你%x到许多巨大的爪印, 闻到腐肉味, 并注意到骨头. ]",
         output = "text",
         text = [[你%x到地上有许多巨大的爪印. 你前面的隧道
比你曾经去过的任何洞穴都要大.

你的鼻子闻到了里面的腐肉味, 隧道两边
散落着骨头. ]],
      },
      locate_next = {
         text = "又一次, 你接近%i.",
      },
      nemesis_first = {
         synopsis = "[%nC威胁要吃掉你. ]",
         output = "text",
         text = [["那么, %l的追随者, 你试图入侵
%n的巢穴. 只有我的食物才被允许在这里. 准备
被吃掉吧! \"]],
      },
      nemesis_next = {
         text = [["那么, 你又来面对我了, %c. 以前从没有人从我手中逃脱过.
现在我要杀了你. \"]],
      },
      nemesis_other = {
         text = "\"你变得烦人了, %c. 准备受死吧. \"",
      },
      nemesis_wantsit = {
         text = "\"我会从你那里拿回%o, %c. 你会死的. \"",
      },
      nexttime = {
         text = "又一次, 你回到了%H.",
      },
      offeredit = {
         synopsis = "[\"带上%o. 它将帮助你寻找岩德的护身符. \"]",
         output = "text",
         text = [[%lC瞥见了你手中的%o.
他微笑着说道:

    你做到了! 我们得救了. 但我担心%o
    总会成为%C势力的目标, 他们会想要它为己用.

    为了防止进一步的麻烦, 我希望你, %p,
    把%o带走. 它会在你寻找
    岩德护身符时帮助你. ]],
      },
      offeredit2 = {
         synopsis = "[\"你现在是%o的守护者了. 回到%Z去寻找护身符. ]",
         output = "text",
         text = [[%l自豪地握着%o片刻, 然后看着你.

\"你现在是它的守护者, 是时候继续寻找
护身符了. %Z正等待你通过
带你来到这里的魔法传送门返回. \"]],
      },
      othertime = {
         text = [[出于某种原因, 你认为这可能是你最后一次
进入%H. ]],
      },
      posthanks = {
         text = [["%pC! 欢迎回来.
你为%d找回护身符的任务进展如何? \"]],
      },
   },
   Hea = {
      assignquest = {
         synopsis = "[前往%i, 在从%n那里找回%o的路上. ]",
         output = "text",
         text = [[你第一次感觉到%l脸上露出了微笑.

    \"你确实学到了我们所能教你的所有东西, 为
    这个任务做准备. 让我告诉你我所知道的症状, 并希望
    你能提供治愈方法.

    \"不久前, 可怕的%nt被众神愚弄,
    以为%nh可以用%o找到
    治疗衰老的方法. 想想看, 永生! 但%nj的
    良好健康是通过吸取%ni周围人的健康来实现的.

    \"他已经耗尽了自己可用的健康人群, 现在%nh试图
    将%nj的影响扩展到我们的世界. 你必须从%ni那里找回
    %o并打破咒语.

    \"你必须进入沼泽地前往%i, 然后从那里
    追踪到%n的岛屿巢穴. 小心. \"]],
      },
      badalign = {
         synopsis = "[等你变得更%a了再回来. ]",
         output = "text",
         text = [["你已经学到了很多有益的治疗方法, 但你也必须知道
哪种药治哪种病. 这就是为什么%d的教导是你
训练的一部分.

\"等你治好了自己再回来找我们. \"]],
      },
      badlevel = {
         synopsis = "[你太缺乏经验了. 等你成为%Ra之后再回来. ]",
         output = "text",
         text = [["唉, %p, 你还太缺乏经验, 无法应对
如此艰巨的任务. 你必须能够运用植物学,
炼金术和兽医学的知识, 我才能凭良心派你去执行这个任务.

\"当你戴上%Ra的双蛇杖时再回来. \"]],
      },
      discourage = {
         "\"他们把手术刀交给巫师, 也好过让你尝试使用%o! \"",
         "\"如果我能击败被%lj%gP包围的%l, 想象一下我在这里独自一人能对你做什么. \"",
         "\"我会让我的%Rp用你的骨灰制药. \"",
         "\"就在我们说话的时候, 哈迪斯正在召集你的病人加入你. \"",
         "\"我干掉你之后, 也会摧毁%l. \"",
         "\"你必须杀了我才有希望离开这个地方. \"",
         "\"我会把你的头刺在我的双蛇杖上供所有人观看. \"",
         "\"你袋子里没有任何药材能治好我的病! \"",
         "\"别太拼命, 我要你的灵魂强壮, 而不是虚弱! \"",
         "\"你应该早点止步于兽医学. \"",
      },
      encourage = {
         "\"记住, %p, 手术前一定要洗手. \"",
         "\"%nC没有真正属于自己的魔法. %nh在这方面很脆弱. \"",
         "\"如果你一直忠于%d, 你就可以运用%o的力量. \"",
         "\"带上解毒剂. \"",
         "\"记住这一点, %n可以扭曲%o的力量来伤害而不是治愈. \"",
         "\"我已经派人去找喀戎, 但我担心他来得太晚了. \"",
         "\"也许当你回来时, 蛇会再次开始蜕皮. \"",
         "\"瘟疫在我们说话时越来越严重. 快, %p! \"",
         "\"%n在这片土地上已经引起了许多次麻烦. 是时候像%nh引起的疾病一样根除%nh了. \"",
         "\"只有一只眼睛的%n应该很容易被弄瞎. 记住这一点. \"",
      },
      firsttime = {
         synopsis = "[你回到%H, 必须找到%l. ]",
         output = "text",
         text = [[是什么巫术把你带回了%H? 新鲜的火葬柴堆
的气味告诉你, 曾经在这里行医的治愈力量出了
问题.

没有草药师在照料药材花园, 那些曾经
来寻求治疗的普通百姓又在哪里?

你知道你必须赶紧前往学院和
%l的诊所, 看看你不在的时候发生了什么. ]],
      },
      goal_first = {
         synopsis = "[你已经到达%n的巢穴. 从%ni那里拿走%o. ]",
         output = "text",
         text = [[你站在臭名昭著的%n岛视线之内. 即使是
%l的话也没有让你为此做好准备.

你咬紧牙关, 忍受着刺痛你耳朵的病人哀嚎,
匆匆继续你的任务. 也许有了%o, 你
可以在回来时治愈他们, 但现在不行. ]],
      },
      goal_next = {
         text = "又一次, 你在远处%x到%n岛.",
      },
      gotit = {
         synopsis = "[你感觉到%o的治愈力量, 应该把它还给%l. ]",
         output = "text",
         text = [[当你拿起%o时, 你感觉到它的治愈开始
温暖你的灵魂. 你诅咒宙斯把它从它真正的主人那里拿走,
但你至少希望%l能再次好好利用它. ]],
      },
      guardtalk_after = {
         "\"你看了那篇关于水蛭治疗用途的新论文吗? \"",
         "\"在你的盾牌上画一个红色的双蛇杖, 怪物就不会打中你了. \"",
         "\"你感觉怎么样? 也许放点血会改善你的精神. \"",
         "\"你听过那个荒谬的新理论吗, 说疾病是由微生物引起的, 而不是不良体液? \"",
         "\"我看到你带着%o, 现在你可以治愈这场瘟疫了! \"",
      },
      guardtalk_before = {
         "\"你看了那篇关于水蛭治疗用途的新论文吗? \"",
         "\"在你的盾牌上画一个红色的双蛇杖, 怪物就不会打中你了. \"",
         "\"我通过了笔迹测试, 所以他们在把我降级. \"",
         "\"我听说连%l都没能治好喀戎. \"",
         "\"我们认为%n用%nj炼金术士和%o, 在地狱释放了一种叫做\'感冒\'的新疾病. \"",
      },
      hasamulet = {
         synopsis = "[\"你已经找回了护身符. 前往星界, 把它还给%d. \"]",
         output = "text",
         text = [["啊, 你找回了护身符, %p. 干得好!

\"现在, 你应该知道, 你必须穿越元素位面
前往星界, 在那里把护身符还给%d. 前进吧,
愿我们的祈祷像你背上的风一样. \"]],
      },
      killed_nemesis = {
         synopsis = "[%nC在你%nh死时诅咒你. ]",
         output = "text",
         text = [[%n被打得遍体鳞伤的身体瘫倒在地, 喘着气发出
最后的诅咒:

    \"你击败了我, %p, 但我会报仇的.
    怎么报, 我不说, 但这个诅咒会像癌症一样
    缠着你. \"

说完%n就死了. ]],
      },
      leader_first = {
         synopsis = "[%l在与%n的斗争中变得虚弱. %lH想检查你. ]",
         output = "text",
         text = [[%l虚弱地抬起头看着你.

\"很高兴再次见到你, %p. 我从你眼中看到了关切,
但不要为我担心. 我还没准备好去哈迪斯呢. 我们
已经耗尽了大部分治愈力量来抵御%n.
我需要你新鲜的力量来继续我们的工作.

\"靠近一点, 让我把双手放在你身上, 看看你是否
具备完成这个任务所需的技能. \"]],
      },
      leader_last = {
         synopsis = "[你作为一个治疗师是失败的. ]",
         output = "text",
         text = [["你辜负了我们, %p. 你是个庸医! 一个骗子!

\"哈迪斯会很高兴听到你又在
对毫无戒心的人施展你的医术. \"]],
      },
      leader_next = {
         text = [["你又回到了我身边, %p. 我感觉每次回来
我们土地的胸膜炎和疾病都开始感染你. 让我们
希望并祈祷%d, 希望你能在
你成为这些不良体液的牺牲品之前准备好你的任务. \"]],
      },
      leader_other = {
         text = [["喀戎倒下了, 赫尔墨斯倒下了, 我还要告诉你什么才能
让你明白你任务的重要性! 我希望你这次
已经准备好了. \"]],
      },
      locate_first = {
         synopsis = "[你已经到达%i, 但一切并不顺利. ]",
         output = "text",
         text = [[你站在%i的入口前. 奇怪的
刮擦声从建筑内部传来.

你周围的沼泽地似乎散发着疾病的气息. ]],
      },
      locate_next = {
         text = "又一次, 你站在%i的入口前.",
      },
      nemesis_first = {
         synopsis = "[\"我会取走你的命, 然后击败%l. \"]",
         output = "text",
         text = [["派你来是个错误, %p.

\"当我把你的青春加到我身上时, 只会让我更容易
击败%l. \"]],
      },
      nemesis_next = {
         text = "\"不像你的病人, 你似乎总是回来, %p! \"",
      },
      nemesis_other = {
         text = "\"你想要哪个, %p? 疖子, 胸膜炎, 抽搐? \"",
      },
      nemesis_wantsit = {
         text = [["我会从你那里拿回%o, %r. 你
不会活着离开这个地方的. \"]],
      },
      nexttime = {
         text = [[经历了上次的经历, 你本以为会来到这里, 但你绝对
没想到情况会变得更糟. 这次你必须成功. ]],
      },
      offeredit = {
         synopsis = "[%l触摸%o并告诉%lj%gP也这样做, 然后告诉你带着它. ]",
         output = "text",
         text = [[%l一看到%o就召唤%lj
%gP.

%l轻轻地伸出手触摸%o.
他指示每个集结的人也这样做. 当所有人
都完成后, %lh对你说道.

    \"既然我们已经补足了我们自己, 我们可以击败这场瘟疫了. 你必须
    带着%o, 并补足你接下来被召唤前往的
    世界. 我希望你能骑喀戎到
    你旅程的终点, 但我需要他帮我传播治愈方法. 现在
    走吧, 继续你的旅程. \"]],
      },
      offeredit2 = {
         synopsis = "[%l告诉你保留%o并回到%Z去寻找护身符. ]",
         output = "text",
         text = [[%l小心翼翼地拿着%o, 同时看着你.

\"你现在是它的守护者, 是时候继续寻找
护身符了. %Z正等待你通过
带你来到这里的魔法传送门返回. \"]],
      },
      othertime = {
         text = [[又一次, 你在远处%x到%H.

死亡和疾病的气味弥漫在空气中. 你不需要
是%Ra就知道%n即将胜利. ]],
      },
      posthanks = {
         text = [["你又一次回到了我们身边, %p. 我们不在的时候做得很好, 对吧?
你寻找护身符的任务进展如何? \"]],
      },
   },
   Kni = {
      assignquest = {
         synopsis = "[穿过%i到达%n. 摧毁%ni并带着%o回来. ]",
         output = "text",
         text = [["啊, %p. 你真的准备好了, 没有哪个%c在你之前
如此. 现在听我说:

\"正如你接近%H时注意到的, 最近在这些田野上
进行了一场大战. 要知道, 当我们与邪恶的%n
交战时, 梅林本人亲自来帮助我们. 在那场战斗中,
%n给了梅林重重一击, 将他击倒. 然后, 当我们的
部队被逼退时, %n偷走了%o.

\"我们最终扭转了局势, 但在战斗中失去了许多%cP.
梅林被他的学徒带走, 但一直没有康复. 我们被告知
只要%n拥有%o,
梅林就不会恢复健康.

\"我们特此委托你这个最重要的职责:

\"从这里出发, 前往沼泽地, 在那里你会找到
%i. 从那里, 你必须追踪%n. 摧毁那个
野兽, 并把%o归还给我们. 只有这样
我们才能恢复梅林的健康. \"]],
      },
      badalign = {
         synopsis = "[去做忏悔吧. 当你真正%a了再回来. ]",
         output = "text",
         text = [["你羞辱了我们, %p! 你已经偏离了骑士精神的道路!
离开我们的视线去做忏悔. 只有当你再次纯洁
之后, 你才能回到这里. \"]],
      },
      badlevel = {
         synopsis = "[你还没准备好面对%n. 等你成为%Ra后再回来. ]",
         output = "text",
         text = [["诚然, %p, 你做得很好. 你能活到现在
是你勇气的荣耀, 但你还没有准备好面对
作为我们的勇士所需的要求. %rA, 无论多么
纯洁, 都绝不可能希望击败邪恶的%n.

\"从这里出发, 磨练你的技能. 当你
获得了%R的高贵头衔后再回到我们面前. \"]],
      },
      discourage = {
         "\"区区%r永远无法抵挡我! \"",
         "\"我现在就杀了你, 然后享用! \"",
         "\"可怜的%c. 你想要什么样的死法? \"",
         "\"先是你, %p, 然后我会享用%l. \"",
         "\"哈! 你失败了, %r. 现在你死定了. \"",
         "\"去死吧, %c. 你与我的力量相比不值一提. \"",
         "\"我会吸干你骨髓里的汁液, %c. \"",
         "\"让我想想... 烤? 不. 炸? 不. 炙烤? 是的, 诚然, 那是我喜欢%c当晚餐的方式. \"",
         "\"你的力量在衰退, %p. 你的死亡时刻正在临近. \"",
         "\"呼唤你宝贵的%d吧, %p. 它帮不了你. \"",
      },
      encourage = {
         "\"记住, %p, 始终遵循%d的道路. \"",
         "\"尽管%n确实是一个强大的对手, 我们对你的胜利有信心. \"",
         "\"小心, 因为%n用成群的邪恶生物包围了%niself. \"",
         "\"据说, %n的巢穴中囤积着巨大的财宝. \"",
         "\"如果你拥有%o, %p, %n的魔法就会被它挫败. \"",
         "\"%i的大门由看不见的力量守卫着, %p. 小心行事. \"",
         "\"快点把%o还给我们, %p. \"",
         "\"摧毁%n, %p, 否则%H必然沦陷. \"",
         "\"当你需要的时候呼唤%d. \"",
         "\"要找到%i, 你必须保持心灵纯洁. \"",
      },
      firsttime = {
         synopsis = "[战斗的痕迹包括%H墙壁上的长条划痕. ]",
         output = "text",
         text = [[你显现在%H的阴影中. 你立刻注意到
有些不对劲. 城堡周围的田野被践踏和
枯萎, 好像最近有一场大战.

进一步探索, 你%x到%H墙壁上的长条划痕.
你知道只有一种生物会制造那种痕迹... ]],
      },
      goal_first = {
         synopsis = "[你%x到一个山丘内的洞穴入口. ]",
         output = "text",
         text = [[当你离开沼泽时, 你%x到面前一个巨大的, 张开的洞口,
位于一个山丘的侧面. 从里面, 你闻到腐烂的恶臭.

入口两边的水池被鲜血污染, 生锈的金属碎片
和破碎的武器露出水面. ]],
      },
      goal_next = {
         text = "又一次, 你站在%n巢穴的入口处.",
      },
      gotit = {
         synopsis = "[你感觉到%o的魔法. ]",
         output = "text",
         text = [[当你拿起%o时, 你感觉到它的保护场
在你的身体周围形成. 你也感觉到脑海中有一丝微弱的悸动, 仿佛
你同时存在于两个地方, 而在第二个地方, 你正从
长眠中醒来. ]],
      },
      guardtalk_after = {
         "\"万岁, %p! 诚然, 你看起来很好. \"",
         "\"那么, %p, 你在%i附近的沼泽地里找到%n了吗? \"",
         "\"可敬的%p, 你是否在%n的尸体上证明了你正义的目的? \"",
         "\"诚然, %l不可能有比你更好的勇士了, %p. \"",
         "\"你真的找回了%o吗? \"",
      },
      guardtalk_before = {
         "\"万岁, %p! 诚然, 你看起来很好. \"",
         "\"有消息说, %p, %n在%i附近的沼泽地被发现了. \"",
         "\"你现在是我们唯一的希望了, %p. \"",
         "\"诚然, %l不可能有比你更好的勇士了, %p. \"",
         "\"许多勇敢的%cP在%n袭击时牺牲了. \"",
      },
      hasamulet = {
         synopsis = "[把护身符带到星界, 交给%d. ]",
         output = "text",
         text = [["你成功了, 我们看到, %p! 现在你奉命
把护身符带到星界位面, 献给%d.

\"梅林告诉我们, 你必须始终向上穿过
元素位面, 才能实现这个目标.

\"与%d同行吧, %p. \"]],
      },
      killed_nemesis = {
         synopsis = "[%nC在你%nh死时诅咒你. ]",
         output = "text",
         text = [[当%n倒在地上, 鲜血从%nj张开的嘴里涌出时, %nh
倔强地诅咒你和%l:

    \"你还没有赢, %r. 以诸神之名, 我会回来
    并一直跟踪你的脚步直到坟墓! \"

%nJ尾巴疯狂地甩动, %n试图爬向你, 但瘫倒
在地上, 死在%nj自己的血泊中. ]],
      },
      leader_first = {
         synopsis = "[%lC检查你是否准备好承担一项伟大任务. ]",
         output = "text",
         text = [["啊, %p. 我们看到你收到了我们的召唤.
我们急需你的prowess. 但首先, 我们必须
判断你是否准备好了承担这项伟大任务. \"]],
      },
      leader_last = {
         synopsis = "[你作为%ca是个耻辱. ]",
         output = "text",
         text = [["你以你不纯的存在羞辱了这个高贵的宫廷. 我们对你一直
很宽容, 但不再宽容了. 你的名字将不再被提起. 我们
特此剥夺你的头衔, 土地和作为%ca的地位.
滚出我们的视线! \"]],
      },
      leader_next = {
         text = "\"再次欢迎, %p. 我们希望你现在准备好了. \"",
      },
      leader_other = {
         text = "\"又一次, 你站在我们面前, %p. 你现在准备好了吗? \"",
      },
      locate_first = {
         synopsis = "[你已经到达%i, 可以%x到一个神殿. ]",
         output = "text",
         text = [[你站在%i的脚下. 在顶上, 你可以%x到一个神殿.
奇怪的能量似乎集中在这里, 你脖子后面的头发
竖了起来. ]],
      },
      locate_next = {
         text = "又一次, 你站在%i的脚下.",
      },
      nemesis_first = {
         synopsis = "[%nC嘲弄你并对%H发出威胁. ]",
         output = "text",
         text = [["哈! 又一个可怜的%c在寻求死亡. 我今晚会享用大餐,
然后明天, %H就要沦陷了! \"]],
      },
      nemesis_next = {
         text = "\"你又来挑战我了, %r? 那就这样吧. 你会死在这里. \"",
      },
      nemesis_other = {
         text = "\"你真蠢, %r. 我立刻就会把你干掉. \"",
      },
      nemesis_wantsit = {
         text = [["*所以*, 你胆敢碰我的财产! 我会拿回那个小玩意儿,
可怜的%r. 你会在痛苦中死去! \"]],
      },
      nexttime = {
         text = "又一次, 你站在%H的阴影中.",
      },
      offeredit = {
         synopsis = "[%oC现在是你的了. 它将在你寻找护身符时提供帮助. ]",
         output = "text",
         text = [[当你接近%l时, %lh对你微笑并说道:

    \"干得好! 你是%H的真正的勇士. 我们
    收到消息说梅林正在康复, 很快就会
    回到我们身边.

    \"他指示我们, 你现在应该成为
    %o的守护者. 他感觉你很可能在
    你的冒险中需要它的力量. 我们希望你能
    带着%o, 在你寻找传说中的
    岩德护身符时. \"]],
      },
      offeredit2 = {
         synopsis = "[你是%o的守护者. 回到%Z去寻找护身符. ]",
         output = "text",
         text = [["小心, %p! %oC可能会碎, 那将是
一个悲剧性的损失. 你现在是它的守护者, 是时候
继续寻找护身符了. %Z正等待你
通过带你来到这里的魔法传送门返回. \"]],
      },
      othertime = {
         text = [[又一次, 你站在%H面前. 你隐约感觉到这
可能是你最后一次站在%l面前. ]],
      },
      posthanks = {
         text = "\"幸会, %p. 你寻找岩德护身符的任务进展如何? \"",
      },
   },
   Mon = {
      assignquest = {
         synopsis = "[找到%i, 然后继续前往%n的巢穴. 击败%ni并带着%o回来. ]",
         output = "text",
         text = [["是的, %p. 你现在真正准备好了. 注意听我说, 我会
告诉你发生了什么:

\"不久前在一次大冥想中, %n和
一队元素生物入侵了%H. 许多%gP
被杀, 包括携带%o的那位.

\"现在, 剩下的%gP勉强能把元素生物
挡在门外.

\"我们需要你找到%i, 然后从那里
前往%n的巢穴. 如果你能设法击败%n并把
%o带回这里, 我们就能赶走那些
杀害我们学生的元素生物军团.

\"以%d为你的向导, %p. \"]],
      },
      badalign = {
         synopsis = "[你必须赎罪. 当你配得上%d时再回来. ]",
         output = "text",
         text = [["这太糟糕了, %p. 你已经偏离了正确的的道路!
你知道%d要求这个教团保持最严格的风险.
%s的教团必须代表极致虔诚.

\"离开这里, 为你对%d的罪行赎罪. 只有当你
净化了自己之后才能回来. \"]],
      },
      badlevel = {
         synopsis = "[你还没准备好面对%n. 当你成为%Ra后再回来. ]",
         output = "text",
         text = [["唉, %p, 时机未到. 区区%r永远无法
承受%n的力量. 出发吧, 再次进入世界, 当你
达到了%R的职位后再回来. \"]],
      },
      discourage = {
         "\"顺从我, %c, 我会饶你一命. \"",
         "\"你可怜的力量不是我的对手, %c. \"",
         "\"我会把你变成僵尸供我取乐! \"",
         "\"现在绝望吧, %r. %d帮不了你. \"",
         "\"我会尽情享用你的灵魂很多天, %c. \"",
         "\"你的死亡会是缓慢而痛苦的. 我保证! \"",
         "\"你无法击败%n, 傻瓜. 我现在就杀了你. \"",
         "\"你珍视的%l将是我的下一个受害者. \"",
         "\"我感觉你的力量在衰退, %r. 你现在会死. \"",
         "\"有了%o, 没有什么能阻挡我. \"",
      },
      encourage = {
         "\"如果你依靠%d, 你就能获胜. \"",
         "\"记住%n拥有强大的魔法. \"",
         "\"保持纯洁, 我的%S. \"",
         "\"小心, %i被成群的土元素包围着. \"",
         "\"记住你的学习, 你就会成功! \"",
         "\"如果可能的话, 获取并佩戴%o. 它会在对抗%n时帮助你. \"",
         "\"当你最需要的时候呼唤%d. 你会得到回应. \"",
         "\"记住利用元素生物的力量对抗它们! \"",
         "\"不要失去信念, %p. 如果你失去了, %n会变得更强. \"",
         "\"佩戴%o. 它会帮助你努力. \"",
      },
      firsttime = {
         synopsis = "[你已经到达%H, 但有些不对劲. %lC需要你的帮助! ]",
         output = "text",
         text = [[你发现自己站在%H的视线之内.
这里显然有些不对劲. 奇怪的身影在%H外面
笨重地移动!

你意识到%l需要你的帮助! ]],
      },
      goal_first = {
         synopsis = "[你被硫磺, 熔岩和元素生物包围. ]",
         output = "text",
         text = [[硫磺的恶臭包围着你, 元素生物从四面八方
逼近!

前方, 在冒泡的熔岩坑之间有一小块空地... ]],
      },
      goal_next = {
         text = "又一次, 你侵入了%n的领域.",
      },
      gotit = {
         synopsis = "[你感觉到%d的本质, 并意识到你应该把%o带给%l. ]",
         output = "text",
         text = [[当你拿起%o时, 你感觉到%d的本质
充满了你的灵魂. 你现在知道为什么%n从
%H偷走%oi了, 因为有了%oi, %d的%ca
可以轻易挫败他的计划.

你感觉到来自%d的信息. 虽然不是言语, 但
你得到的感觉是必须尽快回到%l那里. ]],
      },
      guardtalk_after = {
         "\"你好, 尊敬的%r. 很高兴再次见到你. \"",
         "\"啊, %p! 我们对你所有的帮助深表感激. \"",
         "\"你好, %s. 也许你会花点时间和我们一起冥想? \"",
         "\"通过了这个考验, 愿%d带给你启蒙. \"",
         "\"愿%d与你同在, %s. \"",
      },
      guardtalk_before = {
         "\"你好, 尊敬的%r. 很高兴见到你. \"",
         "\"啊, %p! 你肯定能在我们急需的时候帮助我们. \"",
         "\"你好, %s. %lC非常需要你的帮助. \"",
         "\"唉, 似乎连%d都抛弃了我们. \"",
         "\"愿%d与你同在, %s. \"",
      },
      hasamulet = {
         synopsis = "[把护身符带到星界, 交给%d. ]",
         output = "text",
         text = [["你赢了, %p! %d肯定与你同在. 现在,
你必须带着护身符, 在星界位面的%d祭坛上
献祭它. 我猜想我这辈子再也见不到你了,
但我希望在%d的脚下与你相见. \"]],
      },
      killed_nemesis = {
         synopsis = "[当%n死去时, %nh威胁要回来. ]",
         output = "text",
         text = [[%nC喘着气说:

    \"你只是击败了这个凡人的身体. 要知道: 我的灵魂
    很强大. 我会回来夺回属于我的东西! \"

说完, %n就死了. ]],
      },
      leader_first = {
         synopsis = "[%lC检查你是否准备好迎接重大挑战. ]",
         output = "text",
         text = [["啊, %p, 我的%S. 你终于回到了我们身边.
我们的教团遭受了沉重打击; 也许你能帮助我们.
首先, 我必须确定你是否准备好了迎接这个
重大挑战. \"]],
      },
      leader_last = {
         synopsis = "[你是个异教徒, 完全失败了. ]",
         output = "text",
         text = [["你是个异教徒, %p! 你身为%ra, 怎么能如此偏离
%d的教导? 离开这座寺庙. 你不再是
这个教团的%s了. 我们将向%d祈祷寻求其他帮助,
因为你完全辜负了我们. \"]],
      },
      leader_next = {
         text = "\"再次, 我的%S, 你站在我面前. 你现在准备好帮助我们了吗? \"",
      },
      leader_other = {
         text = "\"又一次, %p, 你站在圣所内. 你现在准备好了吗? \"",
      },
      locate_first = {
         synopsis = "[你已经到达%i. %nC潜伏在更前方. ]",
         output = "text",
         text = [[你记得%l给你的关于%i的描述.
就在前面, 你会找到%n的踪迹. ]],
      },
      locate_next = {
         text = "又一次, 你站在%i面前.",
      },
      nemesis_first = {
         synopsis = "[你不是%g. 你永远拿不回%o. ]",
         output = "text",
         text = [["啊, 所以%l派了另一个%g来取回
%o.

\"不, 我看你不是%g. 也许我今天终究能找到点乐子
吧. 准备受死吧, %r! 你永远拿不回
%o.\"]],
      },
      nemesis_next = {
         text = "\"那么, %r. 你又来挑战我了. \"",
      },
      nemesis_other = {
         text = "\"现在去死吧, %r. %d在这里没有力量帮助你. \"",
      },
      nemesis_wantsit = {
         text = "\"你会死的, %r, 我会拿回%o. \"",
      },
      nexttime = {
         text = "又一次, 你站在%H面前.",
      },
      offeredit = {
         synopsis = "[保留%o. %oH将帮助你找回岩德的护身符. ]",
         output = "text",
         text = [["你回来了, %p. 还带着%o, 我看到了.
恭喜.

\"我一直在冥想, 并收到了来自
%d仆从的指示. %d命令你保留
%o. 有了%oi, 你必须找回岩德
的护身符.

\"出发吧, 让%d指引你的脚步. \"]],
      },
      offeredit2 = {
         synopsis = "[保留%o并回到%Z去寻找护身符. ]",
         output = "text",
         text = [[%lC研究了一会儿%o,
然后把目光转回你身上.

\"%oC必须留在你身边. 当你
继续寻找护身符时, 使用%oi.
%Z正等待你通过带你来到这里的魔法传送门
返回. \"]],
      },
      othertime = {
         text = [[再次面对%H. 你的直觉暗示这
可能是你最后一次来这里. ]],
      },
      posthanks = {
         text = "\"欢迎回来, %p. 你的护身符任务进展如何? \"",
      },
   },
   Pri = {
      assignquest = {
         synopsis = "[%nC入侵了%H并夺取了%o. 击败%ni并取回%oh. ]",
         output = "text",
         text = [["是的, %p. 你现在真正准备好了. 注意听我说, 我会
告诉你发生了什么:

\"不久前在一次大节日上, %n和一队不死生物
入侵了%H. 许多%gP被杀, 包括
携带%o的那位.

\"作为最后的报复行为, %n亵渎了这里的祭坛.
没有它, 我们无法发起反击. 现在, 剩下的
%gP勉强能把不死生物挡在门外.

\"我们需要你找到%i, 然后从那里
前往%n的巢穴. 如果你能设法击败%n并把
%o带回这里, 我们就能赶走那些
污染这片土地的不死生物军团.

\"以%d为你的向导, %p. \"]],
      },
      badalign = {
         synopsis = "[你已经偏离了道路. 等你净化了自己再回来. ]",
         output = "text",
         text = [["这太糟糕了, %p. 你已经偏离了正确的的道路!
你知道%d要求这个教团保持最严格的风险.
%s的教团必须代表极致虔诚.

\"离开这里, 为你对%d的罪行赎罪. 只有当你
净化了自己之后才能回来. \"]],
      },
      badlevel = {
         synopsis = "[%rA无法承受%n. 当你成为%Ra后再回来. ]",
         output = "text",
         text = [["唉, %p, 时机未到. 区区%r永远无法
承受%n的力量. 出发吧, 再次进入世界, 当你
达到了%R的职位后再回来. \"]],
      },
      discourage = {
         "\"顺从我, %c, 我会饶你一命. \"",
         "\"你可怜的力量不是我的对手, %c. \"",
         "\"我会把你变成僵尸供我取乐! \"",
         "\"现在绝望吧, %r. %d帮不了你. \"",
         "\"我会尽情享用你的灵魂很多天, %c. \"",
         "\"你的死亡会是缓慢而痛苦的. 我保证! \"",
         "\"你无法击败%n, 傻瓜. 我现在就杀了你. \"",
         "\"你precious的%l将是我的下一个受害者. \"",
         "\"我感觉你的力量在衰退, %r. 你现在会死. \"",
         "\"有了%o, 没有什么能阻挡我. \"",
      },
      encourage = {
         "\"如果你依靠%d, 你就能获胜. \"",
         "\"记住%n拥有强大的魔法. \"",
         "\"保持纯洁, 我的%S. \"",
         "\"小心, %i被一个大墓地包围着. \"",
         "\"你可能可以用魔法寒冷影响%n. \"",
         "\"如果可能的话, 获取并佩戴%o. 它会在对抗%n时帮助你. \"",
         "\"当你最需要的时候呼唤%d. 你会得到回应. \"",
         "\"不死生物军团在白天最弱. \"",
         "\"不要失去信念, %p. 如果你失去了, %n会变得更强. \"",
         "\"佩戴%o. 它会在对抗不死生物时帮助你. \"",
      },
      firsttime = {
         synopsis = "[你在%H; 门是关着的. %lC需要你的帮助! ]",
         output = "text",
         text = [[你发现自己站在%H的视线之内. 这里
显然有些不对劲. %H的门通常
敞开着, 现在却关着. 奇怪的人形在外面
蹒跚移动.

你意识到%l需要你的帮助! ]],
      },
      goal_first = {
         synopsis = "[硫磺的恶臭包围着你, 尖叫声和呻吟声无休无止. ]",
         output = "text",
         text = [[硫磺的恶臭包围着你, 折磨灵魂的尖叫和呻吟
冲击着你的psyche.

前方, 在冒泡的熔岩坑之间有一小块空地... ]],
      },
      goal_next = {
         text = "又一次, 你侵入了%n的领域.",
      },
      gotit = {
         synopsis = "[你拿起%o时感觉到%d; 把%oh还给%l. ]",
         output = "text",
         text = [[当你拿起%o时, 你感觉到%d的本质
充满了你的灵魂. 你现在知道为什么%n从
%H偷走它了, 因为有了它, %d的%ca
可以轻易挫败他的计划.

你感觉到来自%d的信息. 虽然不是言语, 但
你得到的感觉是必须尽快回到%l那里. ]],
      },
      guardtalk_after = {
         "\"你好, %r. 很高兴再次见到你. \"",
         "\"啊, %p! 我们对你所有的帮助深表感激. \"",
         "\"欢迎回来, %s! 有了%o, 没有不死生物能对抗我们. \"",
         "\"赞美%d, 因为他把我们从%n手中解救出来. \"",
         "\"愿%d与你同在, %s. \"",
      },
      guardtalk_before = {
         "\"你好, 尊敬的%r. 很高兴见到你. \"",
         "\"啊, %p! 你肯定能在我们急需的时候帮助我们. \"",
         "\"你好, %s. %lC非常需要你的帮助. \"",
         "\"唉, 似乎连%d都抛弃了我们. \"",
         "\"愿%d与你同在, %s. \"",
      },
      hasamulet = {
         synopsis = "[把护身符带到星界, 在%d的祭坛上献上它. ]",
         output = "text",
         text = [["你赢了, %p! %d肯定与你同在. 现在,
你必须带着护身符, 在星界位面的%d祭坛上
献祭它. 我猜想我这辈子再也见不到你了,
但我希望在%d的脚下与你相见. \"]],
      },
      killed_nemesis = {
         synopsis = "[%nC死了. 摩洛知道了你, 并对%n感到愤怒. ]",
         output = "text",
         text = [[当%n的身体化作一团有毒气体消散时, 你感觉到
以太中一阵扭曲.

突然, 一个声音轰然响起:

    \"你击败了我最弱的仆从, %r.
    现在要知道, 摩洛已经知道了你的存在.
    至于你, %n, 我会在闲暇时处理你的失败. \"

然后你听到了%n的声音, 在恐惧中尖叫... ]],
      },
      leader_first = {
         synopsis = "[你回来了, 我们需要你的帮助. 你准备好了吗? ]",
         output = "text",
         text = [["啊, %p, 我的%S. 你终于回到了我们身边.
我们的教团遭受了沉重打击; 也许你能帮助我们.
首先, 我必须确定你是否准备好了迎接这个
重大挑战. \"]],
      },
      leader_last = {
         synopsis = "[你是个异教徒, 偏离了%d的教导. ]",
         output = "text",
         text = [["你是个异教徒, %p! 你身为%ra, 怎么能如此偏离
%d的教导? 离开这座寺庙. 你不再是
这个教团的%s了. 我们将向%d祈祷寻求其他帮助,
因为你完全辜负了我们. \"]],
      },
      leader_next = {
         text = "\"再次, 我的%S, 你站在我面前. 你现在准备好帮助我们了吗? \"",
      },
      leader_other = {
         text = "\"又一次, %p, 你站在圣所内. 你现在准备好了吗? \"",
      },
      locate_first = {
         synopsis = "[你已经找到了%i. 通往%n的踪迹就在前面. ]",
         output = "text",
         text = [[你面对着一个大墓地. 上空的云层
似乎在靠近中心的地方变得更厚. 你感觉到
不死生物的存在, 数量比你见过的都多.

你记得%l给你的关于%i的描述.
就在前面, 你会找到%n的踪迹. ]],
      },
      locate_next = {
         text = "又一次, 你站在%i面前.",
      },
      nemesis_first = {
         synopsis = "[%lC派了你来, 但你不是%gC. 我会摧毁你. ]",
         output = "text",
         text = [["啊, 所以%l派了另一个%gC来取回
%o.

\"不, 我看你不是%gC. 也许我今天终究能找到点乐子
吧. 准备受死吧, %r! 你永远拿不回
%o.\"]],
      },
      nemesis_next = {
         text = "\"那么, %r. 你又来挑战我了. \"",
      },
      nemesis_other = {
         text = "\"现在去死吧, %r. %d在这里没有力量帮助你. \"",
      },
      nemesis_wantsit = {
         text = "\"你会死的, %r, 我会拿回%o. \"",
      },
      nexttime = {
         text = "又一次, 你站在%H面前.",
      },
      offeredit = {
         synopsis = "[恭喜, %p. 保留%o; 去寻找护身符. ]",
         output = "text",
         text = [["你回来了, %p. 还带着%o, 我看到了.
恭喜.

\"我一直在冥想, 并收到了来自
%d仆从的指示. %d命令你保留
%o. 有了它, 你必须找回岩德
的护身符.

\"出发吧, 让%d指引你的脚步. \"]],
      },
      offeredit2 = {
         synopsis = "[%oC现在是你的了. 回到%Z去寻找护身符. ]",
         output = "text",
         text = [[%lC重申%o现在是你的了.

\"是时候继续寻找护身符了.
%Z正等待你通过带你来到这里的魔法传送门
返回. \"]],
      },
      othertime = {
         text = [[再次面对%H. 你的直觉暗示这可能是
你最后一次来这里. ]],
      },
      posthanks = {
         text = "\"欢迎回来, %p. 你的护身符任务进展如何? \"",
      },
   },
   Ran = {
      assignquest = {
         synopsis = "[%nC偷走了%o. 潜入%i并为我们取回%oh. ]",
         output = "text",
         text = [["你确实准备好了, %p. 我会告诉你发生了什么,
以及为什么我们如此迫切需要你的帮助:

\"不久前, 东边的山半人马入侵并
奴役了这个地区的平原半人马. 当地的
领导者现在只是一个傀儡, 为%n服务.

\"在我们上次在这里举行worship集会时, 我们被成群的
敌对半人马袭击, 正如你所目睹的. 在第一次进攻中,
由%n%niself率领的一队人, 设法突破了树林并偷走了
%o.

\"从那以后, 我们一直被围困. 我们不知道我们的魔法屏障
还能维持多久.

\"如果我们想生存下去, 你, %p, 必须潜入
%i. 在那里, 你会找到一条向下的路, 通往
%n的地下洞穴. 他一直垂涎
%o, 肯定会把它留在那里.

\"为我们找回%o, %p! 只有那样%d才会安全. \"]],
      },
      badalign = {
         synopsis = "[你不够%a. 等你净化了自己再回来. ]",
         output = "text",
         text = [["你偏离了, %p! 你知道%d要求
我们保持对%a事物的纯粹奉献!

\"你必须离开我们. 等你净化了自己再回来. \"]],
      },
      badlevel = {
         synopsis = "[你太缺乏经验了. 等你成为%Ra后再回来. ]",
         output = "text",
         text = [["%p, 你还太缺乏经验, 无法承受我们
需要你做的事情带来的要求. %RA或许刚好能做成这件事.

\"当你学到了更多之后再回来, 我的%S. \"]],
      },
      discourage = {
         "\"你的%d什么都不是, %c. 你现在是我的了! \"",
         "\"快跑吧, 小%c! 你绝不可能希望打败%n! \"",
         "\"我的仆人会把你们撕成碎片! \"",
         "\"我会把你的头作为战利品展示. 你觉得那面墙怎么样? \"",
         "\"我会摧毁你%l的树林, 并消灭所有的%gP! \"",
         "\"%d抛弃了你, %c. 你完蛋了. \"",
         "\"%rA? %lC派了一个区区%r来对付我? 哈! \"",
         "\"%lC失败了, %c. %oC永远不会离开这里. \"",
         "\"你真以为你能打败我, 嗯%c? 你错了! \"",
         "\"你变弱了, %c. 我现在就杀了你. \"",
      },
      encourage = {
         "\"有传言说森林半人马和山地半人马已经解决了他们古老的世仇, 现在联合起来对抗我们. \"",
         "\"%nC很强, 而且非常聪明. \"",
         "\"当你找到%o时, 使用它. 它会帮助你生存下来找到我们. \"",
         "\"记住, 让%d做你的向导. \"",
         "\"当你面对%n时, 呼唤%d. 这个举动本身就会激怒他, 给你带来优势. \"",
         "\"%n和他的同类一直憎恨我们. \"",
         "\"我们撑不了太久了, %p. 快! \"",
         "\"要潜入%i, 你必须非常隐蔽. \"",
         "\"记住%n是个吹牛大王. 不要相信他说的话. \"",
         "\"如果你相信%d, 你就能获胜, %p. \"",
      },
      firsttime = {
         synopsis = "[古老的森林树林被半人马包围着. ]",
         output = "text",
         text = [[你来到熟悉的环境中. 在远处, 你%x到
古老的森林树林, 那是敬拜%d的地方.

有些不对劲, 不过. 树林周围是半人马!
而且他们已经注意到你了! ]],
      },
      goal_first = {
         synopsis = "[你进入一个地下建筑群. 远处传来马蹄的哐当声. ]",
         output = "text",
         text = [[你进入一个奇怪的地方, 粗糙切割的洞穴状墙壁
与光滑平整的墙壁相接, 仿佛有人正在
完成一个地下建筑群的建造.

远处, 你听到像是许多马蹄在岩石上
敲击的声音. ]],
      },
      goal_next = {
         text = "又一次, 你进入%n的扭曲城堡.",
      },
      gotit = {
         synopsis = "[你拿起%o感到力量. 是时候把%oh还给%l了. ]",
         output = "text",
         text = [[当你拿起%o时, 它似乎发光, 一股温暖
完全充满了你. 你意识到正是它的力量保护了你的%sP
这么长时间对抗敌人.

你现在必须毫不拖延地把它还给%l--他们的生命
取决于你的速度. ]],
      },
      guardtalk_after = {
         "\"%pC! 我已经好多个月没见你了. 你过得怎么样? \"",
         "\"鸟鸣声回到了树林, 这肯定意味着你打败了%n. \"",
         "\"%lC似乎恢复了一些力量. \"",
         "\"那么, 告诉我们你是如何进入%i的, 以防那里再出现新的邪恶. \"",
         "\"那真的是我看到你携带的%o吗? \"",
      },
      guardtalk_before = {
         "\"%pC! 我已经好多个月没见你了. 你过得怎么样? \"",
         "\"%nC继续威胁着树林. 但我们坚守着. \"",
         "\"%lC正在变弱. 保卫树林所需的魔法消耗着我们. \"",
         "\"记住%i很难进入. 小心那些长翅膀的的干扰. \"",
         "\"我们必须找回%o. 没有它我们会被击溃. \"",
      },
      hasamulet = {
         synopsis = "[你有了护身符! 把它带到星界, 献祭给%d. ]",
         output = "text",
         text = [["你拿到了! 你已经找回了岩德的护身符!
现在听我说, %p, 我会告诉你必须做什么:

\"护身符内部有魔法, 能够将你传送到
星界位面, 那里有%d的主要祭坛.

\"要激活这个魔法, 你必须尽可能向上旅行.
当你到达神殿时, 把护身符献祭给%d.

\"这样你就能完成你的命运. \"]],
      },
      killed_nemesis = {
         synopsis = "[%nC在你%nh死时诅咒你. ]",
         output = "text",
         text = [[%nC倒在地上, 诅咒你和%l, 然后说道:

    \"你打败了我, %r! 但我要用我垂死的最后一口气诅咒你一次!
    你离开我的城堡之前就会死! \"]],
      },
      leader_first = {
         synopsis = "[你回来了, %p. 我们需要你的帮助. 你准备好了吗? ]",
         output = "text",
         text = [["%pC! 你回来了! 感谢%d.

\"我们非常需要你. 但首先, 我必须看看你是否拥有
承担这一责任所需的能力. \"]],
      },
      leader_last = {
         synopsis = "[你不够%a. 我们不承认你的%s身份. ]",
         output = "text",
         text = [["%pC! 你注定了我们所有人的命运. 你散发着%L的影响,
削弱了我们在这片树林中凝聚的力量!

\"滚开! 我们不承认你作为我们%s的身份! 你现在是个外人! \"]],
      },
      leader_next = {
         text = "\"又一次, %p, 你站在我们中间. 你现在准备好了吗? \"",
      },
      leader_other = {
         text = "\"啊, 你又来了, %p. 让我判断一下你准备好了没有... \"",
      },
      locate_first = {
         synopsis = "[这就是%i. 附近有蝙蝠. 小心狮头象! ]",
         output = "text",
         text = [[这一定是%i.

你在一个由许多不同房间组成的洞穴里, 这些房间
通过隧道相互连接. 你的任务是找到并射击
居住在洞穴别处的邪恶狮头象, 同时不要掉进任何
无底坑或用完你有限的箭矢. 祝你好运.

你在洞穴的9号房间. 有隧道通往
5, 8和10号房间.
*沙沙* *沙沙*(附近一定有蝙蝠. )
*嗅*(我能闻到附近邪恶狮头象的气味! )]],
      },
      locate_next = {
         synopsis = "[你在%i里. 有坑. 附近有蝙蝠. ]",
         output = "text",
         text = [[又一次, 你下到%i.

*呼嗖*(我感觉到了来自某些坑的沙沙声. )
*沙沙* *沙沙*(附近一定有蝙蝠. )]],
      },
      nemesis_first = {
         synopsis = "[你来取回%o, 但我会留着%oh, 你会死. ]",
         output = "text",
         text = [["那么, %c. %lC派你来取回%o.

\"好吧, 我会留着那个小玩意儿. 它让我高兴. 你, %c, 会死. \"]],
      },
      nemesis_next = {
         text = "\"又回来了, 嗯? 好吧, 区区%r对我没有威胁! 去死吧, %c! \"",
      },
      nemesis_other = {
         text = "\"你还没学到教训, %c. 你杀不了我! 你现在会死. \"",
      },
      nemesis_wantsit = {
         text = [["我会从你那里拿回%o, %r. 然后我会
杀了你. \"]],
      },
      nexttime = {
         text = "又一次, 你站在%H面前.",
      },
      offeredit = {
         synopsis = "[你成功了. 带着%o去寻找护身符. ]",
         output = "text",
         text = [["%pC! 你成功了! 我担心这是不可能的!

\"你带着%o回来了!

\"我担心, 现在, 半人马会重新集结并策划另一次突袭.
这会花费一些时间, 但如果你能在那之前为%d找到
岩德的护身符, 我们将永远安全.

\"带上%o. 它会帮助你在寻找
护身符的任务中. \"]],
      },
      offeredit2 = {
         synopsis = "[你现在是%o的守护者了. 去找护身符. ]",
         output = "text",
         text = [[%l虔诚地弯了弯%o.

\"有了这把神奇的弓, 人们永远不需要用完箭矢.
你现在是它的守护者, 是时候继续寻找
护身符了. %Z正等待你通过
带你来到这里的魔法传送门返回. \"]],
      },
      othertime = {
         text = [[你有一种最奇怪的感觉, 这可能是你最后一次
进入%H. ]],
      },
      posthanks = {
         text = [["欢迎, %p. 你寻找岩德护身符的任务进展如何? \"]],
      },
   },
   Rog = {
      assignquest = {
         synopsis = "[从%n那里拿到%o并带给%l. ]",
         output = "text",
         text = [["所有不去从那个混蛋%n那里取回%o的人,
后退一步. 好选择, %p, 因为我反正打算派你去. 我的其他%gp
对我来说太宝贵了.

\"交易是这样的. 我想要%o, %n
有%o. 你要去拿到%o
并带回给我. 这么简单的任务, 连你都能理解. \"]],
      },
      badalign = {
         synopsis = "[等你真正%a了再回来. ]",
         output = "text",
         text = [["也许我应该把你在这里的观察点上锁一阵子. 也许看着
真正的%a男人工作会让你恢复些理智. 但我恐怕
无法忍受看你那么久. 等你能够被信任去
正确行事了再回来. \"]],
      },
      badlevel = {
         synopsis = "[%rA没有受过足够的训练来处理这项工作. ]",
         output = "text",
         text = [["在你离开的这段时间里, 你只掌握了
%ra的技艺? 我在那段时间里又训练了十倍的%Rp.
也许我应该派他们中的一个去, 嗯? 那会让你
怎么样, %p? 哦, 对了, 我记得, 我打算杀了你! \"]],
      },
      discourage = {
         "\"我可以建议一个妥协方案. 你对黄金或宝石感兴趣吗? \"",
         "\"请不要逼我杀了你. \"",
         "\"我们都面临严峻的时代. 难道你不讲道理吗? \"",
         "\"我认识%l, 你不是%l, 谢天谢地. \"",
         "\"真遗憾我们没有在更愉快的环境下见面. \"",
         "\"我曾经和你一样, %p. 相信我--我们的方式更好. \"",
         "\"留在我身边, 我会让你成为%o的守护者. \"",
         "\"当你回来时, 无论带不带%o, %l都会杀了你. \"",
         "\"别被骗了, 我准备杀死任何胆敢来抢%o的人. \"",
         "\"我可以让你和Twain重聚. 哦, 你们可以交流多少故事啊. \"",
      },
      encourage = {
         "\"你似乎不明白, %o不在这里, 所以你也不应该在这里! \"",
         "\"愿%d诅咒你手指迟钝. 快走吧! \"",
         "\"我们没有一整年时间. 快走吧! \"",
         "\"你想要一条伤疤项链吗? 我就是那个能做出来的珠宝商! \"",
         "\"懒鬼. 也许我应该叫别人来... \"",
         "\"也许我应该打开你的头盖骨, 看看我的指示是不是在里面? \"",
         "\"这不是一个你能在来世完成的任务, 你知道的. \"",
         "\"每一个活着的人里面都有一个想出来的死人, 而我持有你的钥匙! \"",
         "\"我们的地狱猎犬饲料快用完了, 所以你为什么不动身呢! \"",
         "\"你知道, %o不会因为你吹口哨就过来. 你必须自己去拿. \"",
      },
      firsttime = {
         synopsis = "[你在Ransmannsby, 你受训的地方. 找到%l. ]",
         output = "text",
         text = [[出乎意料地, 你发现自己回到了Ransmannsby, 你受训成为
小偷的地方. 你迅速做出公会手势, 希望你的到来
和你到达%l的的消息能同时传到. ]],
      },
      goal_first = {
         synopsis = "[你感知到%o. ]",
         output = "text",
         text = [[你感觉到一阵巨大的勇气涌动, 感知到
%o的存在. 或者是恐惧? ]],
      },
      goal_next = {
         text = "你脖子后面的头发低声说--那是恐惧.",
      },
      gotit = {
         synopsis = "[你拿起%o, 知道%l不应该拥有它. ]",
         output = "text",
         text = [[当你拿起%o时, 你脖子后面的头发
都掉了. 你立刻明白了为什么%n
宁愿死也不愿让%l得到它. 不知怎的
你知道你也必须这样做. ]],
      },
      guardtalk_after = {
         "\"我完全猜错了Tyvefelle夫人的房子; 我差点丢了性命, 还弄丢了我的撬锁工具. \"",
         "\"你回来了? 连Twain都不再回来了. \"",
         "\"你能施舍一个老扒手一个zorkmid买点水酒吗? \"",
         "\"Fritz试图加入另一边, 现在他成了地狱猎犬的饲料. \"",
         "\"小心你偷的东西, 我听说那个头目已经完善了把石头变成不值钱的玻璃片的技术. \"",
      },
      guardtalk_before = {
         "\"我听说Tyvefelle夫人的房子守卫很松懈. \"",
         "\"你回来了? 连Twain都不再回来了. \"",
         "\"你能施舍一个老扒手一个zorkmid买点水酒吗? \"",
         "\"Fritz试图加入另一边, 现在他成了地狱猎犬的饲料. \"",
         "\"小心你偷的东西, 我听说boss已经完善了把石头变成不值钱的玻璃片的技术. \"",
      },
      hasamulet = {
         synopsis = "[把护身符带到星界, 找到%d的神殿. ]",
         output = "text",
         text = [["我看, 以你的能力和我的头脑, 我们可以统治这个世界.

\"我们要想变得全能, 所需要做的就是让你把那个
小饰品带到星界去. 从那里, %d会
告诉你该怎么做. 一旦完成, 我们将无敌! \"]],
      },
      killed_nemesis = {
         synopsis = "[死前, %n告诉你明智地使用%o. ]",
         output = "text",
         text = [[\"我知道你在想什么, %p. 现在还不算太晚, 你可以
明智地使用%o. 为了你的行会
%sP, 做正确的事. \"

你坐着等待死亡降临到%n身上, 然后
你准备好与%l的下一次会面! ]],
      },
      leader_first = {
         synopsis = "[你欠公会的会费. 如果你能胜任这份工作, 你可以还清. ]",
         output = "text",
         text = [["瞧瞧这是谁, 伙计们--%p回家了. 你似乎
拖欠了会费. 我应该杀了你, 作为对其他
这些不值钱的扒手的警示, 但我有一个更好的计划. 如果你准备好了
也许你可以通过为我做一点小工作来还清你拖欠的会费.
让我们看看你是否准备好了... \"]],
      },
      leader_last = {
         synopsis = "[你必须走. ]",
         output = "text",
         text = [["好吧, %gp, 看来我们的朋友忘了这里谁是
老板. 我们的朋友似乎以为%rp已经
掌权了. 错了. 大错特错! \"

你周围环境的突然变化使你无法听到%l
诅咒的结尾. ]],
      },
      leader_next = {
         synopsis = "[你是蠢还是准备好了? ]",
         output = "text",
         text = [["好吧, 我没想到你会回来. 这说明你要么蠢,
要么你终于准备好接受我的提议了. 为了你好, 让我们希望
不是愚蠢让你回来的. \"]],
      },
      leader_other = {
         text = [["你莫非把我当成了别的%l? 你一定
认为我和你的行为一样蠢. 我警告你别考验我的耐心. \"]],
      },
      locate_first = {
         text = "那些该死的小毛发告诉你, 你离%o更近了.",
      },
      locate_next = {
         text = "不想没偷到%o就去面对%l, 你继续前进.",
      },
      nemesis_first = {
         text = "\"啊! 你一定就是%l的... 嗯, \'英雄\'. 很高兴见到你. \"",
      },
      nemesis_next = {
         text = "\"我们又见面了. 请重新考虑你的行为. \"",
      },
      nemesis_other = {
         synopsis = "[你不能信任%l. ]",
         output = "text",
         text = [["当然, %p, 你一定已经知道你不能信任%l
所做的任何交易. 我可以告诉你如何继续
你的任务, 而不必再遇到他. \"]],
      },
      nemesis_wantsit = {
         synopsis = "[%lC不应该拥有%o. ]",
         output = "text",
         text = [["拜托, 想想你在做什么. 你真的
相信%d会希望%l拥有
%o吗? \"]],
      },
      nexttime = {
         text = [[又一次, 你发现自己回到了Ransmannsby. 美好的回忆被
恐惧所取代, 你知道%l在等着你. ]],
      },
      offeredit = {
         synopsis = "[带上%o走吧. ]",
         output = "text",
         text = [["好吧, 我该死. 你拿到了. 我为你感到骄傲, 你真是个优秀的%r.

\"你不在的时候我开始想, 你和%o
在一起能给我带来比你们分开更多的财宝, 所以你为什么不
带着它呢. 我所要求的只是你弄到的任何赃物中的一份分成.
这比我给%n的出价更好.

\"但是, 你看到%n拒绝时发生了什么.
别让我这次再找别人去追你. \"]],
      },
      offeredit2 = {
         synopsis = "[带上%o去弄到护身符. ]",
         output = "text",
         text = [[%lC似乎想把%o和他口袋里
你发现的那个普通货交换, 但注意到你的警惕,
显然退缩了.

\"去偷护身符吧, 免得有人在你之前拿到.
%Z就在你来的路上, 穿过魔法传送门. \"]],
      },
      othertime = {
         text = [[你用手捋过头发, 希望脖子后面的小东西
保持安静, 并准备好与%l
会面. ]],
      },
      posthanks = {
         synopsis = "[用%o换点东西怎么样? ]",
         output = "text",
         text = [["真是个小偷, %p. 我对用%o
换点东西感兴趣吗? 四处看看, 里面放的任何东西
你想要就拿去. \"]],
      },
   },
   Sam = {
      assignquest = {
         synopsis = "[你必须进入%i, 然后从%n那里取回%o. ]",
         output = "text",
         text = [["どうも, %p桑, 你确实准备好了. 我现在可以告诉你
我需要你做什么.

\"大名%n背叛了我们. 他从我们这里偷走了
%o, 并把它带到了他位于%i
深处的天守阁.

\"如果我不能在天皇来参加祭典时向他展示%o,
他就会知道我没有尽职, 并
要求我切腹.

\"你必须进入%i, 取回
天皇的财产. 快点! 天皇会在5柱香的时间后到这里参加
茶会.

\"Wakarimasuka?\"]],
      },
      badalign = {
         synopsis = "[等你能想%a并做%a时再回来. ]",
         output = "text",
         text = [["%p桑, 你最好成为一个侠客.

\"你有技能, 但除非你有武士道而且知道何时以及
如何使用它们, 否则你就不是武士. 等你能想%a并
做%a时再回来. \"]],
      },
      badlevel = {
         synopsis = "[\"我需要%Ra来击败%n. 等你准备好了再回来. \"]",
         output = "text",
         text = [["%p桑, 你学得很好, 为你的家族赢得了荣誉.
我需要%Ra的技能来击败%n.
去寻找老师吧. 学习他们所学的东西. 当你
准备好了, 回到我身边. \"]],
      },
      discourage = {
         "\"啊, 我终于见到了侠客的大名! \"",
         "\"杀死你对我来说没有荣誉. \"",
         "\"你知道我的剑不杀人就不能回鞘. \"",
         "\"你的出现只会加重%l不亲自来的耻辱. \"",
         "\"我会用你的头发泡茶, 然后端给%l. \"",
         "\"你的恐惧从眼中可见, 懦夫! \"",
         "\"我没听说过你, %p桑; 你的生活就那么一文不值吗? \"",
         "\"如果你不顺从我, 你就会死. \"",
         "\"现在跪下, 完成光荣的两刀. 我会告诉你的%sp你死得很光荣. \"",
         "\"你的师匠是个糟糕的老师. 你将为他教学中的错误付出代价. \"",
      },
      encourage = {
         "\"要击败%n, 你必须克服七种情绪: 喜, 怒, 哀, 乐, 爱, 恶, 欲. \"",
         "\"记住你的荣誉就是我的荣誉, 你以我的名义行事. \"",
         "\"我会去寺庙为你平安归来烧香. \"",
         "\"さようなら. \"",
         "\"失败中也能有荣誉, 但无所得. \"",
         "\"你的神明必须强大才能成功. \"",
         "\"你确实是一个值得尊敬的%R, 但现在你必须成为一个值得尊敬的巫师. \"",
         "\"如果你失败了, %n就会像台风一样席卷大地. \"",
         "\"如果你真的%a, %d会倾听. \"",
         "\"磨利你的剑和你的智慧, 迎接你面前的任务. \"",
      },
      firsttime = {
         synopsis = "[%n的旗帜飘扬在城镇上空. %l发生了什么? ]",
         output = "text",
         text = [[甚至在你的感官调整好之前, 你就认出了%H的神明.

你%x到你的宿敌%n的旗帜飘扬在
城镇上空. 这样的事情怎么可能发生? 为什么忍者
自由游荡; 你的大名%l的武士在哪里?

你迅速向伊邪那岐和伊邪那美祈祷, 然后走向
城镇. ]],
      },
      goal_alt = {
         text = "当你再次到达%n的家时.",
      },
      goal_first = {
         synopsis = "[你感觉到%n的嘲讽, 但向%d祈祷后, 你继续前进. ]",
         output = "text",
         text = [[在你的脑海中, 你听到%n的嘲讽.

你像稻谷一样弯下腰, 向%d
祈祷. 但当风过后, 你再次
挺立. 把你的神交给命运之手, 你前进. ]],
      },
      goal_next = {
         text = [[当你再次到达%n的家时, 你的思绪
只转向%o. ]],
      },
      gotit = {
         synopsis = "[你感受到%o的力量, 并感到谦卑. ]",
         output = "text",
         text = [[当你拿起%o时, 你感觉到它的业力.
你立刻明白了为什么那么多优秀的武士必须为保卫它而牺牲.
你感到谦卑, 知道你手中握有太阳女神的
众多神器之一. ]],
      },
      guardtalk_after = {
         "\"来吧, 和我们一起喝烧酒庆祝. \"",
         "\"いかがですか? \"",
         "\"你为我们的氏族和%l带来了极大的荣誉. \"",
         "\"拜托%r, 坐一会儿, 告诉我们你是如何战胜Ninja的. \"",
         "\"%lC还活着! 你拯救了我们, 使我们免于成为ronin. \"",
      },
      guardtalk_before = {
         "\"要成功, 你必须像风中的蝴蝶一样行走. \"",
         "\"いかがですか? \"",
         "\"我为高天原感到担忧. \"",
         "\"%nC雇佣了忍者--小心. \"",
         "\"如果%o没有归还, 我们都会成为浪人. \"",
      },
      hasamulet = {
         synopsis = "[把护身符带到星界去完成你的任务. ]",
         output = "text",
         text = [["啊, %pさま. 你回家是浪费了精力.
既然你拥有了护身符, 你就有荣誉义务去
完成你已经开始的任务. 等你完成后
会有足够的时间喝烧酒和讲故事.

\"现在走吧, 愿我们的祈祷成为你背上的风. \"]],
      },
      killed_nemesis = {
         synopsis = "[%nC死时没有荣誉. ]",
         output = "text",
         text = [[你的治疗技能告诉你%n的伤口是致命的.

你知道武士道告诉你结束他的生命, 让他的神
带着荣誉死去, 但想到这么多武士因这个
人的耻辱而死, 你无法给出最后一击.

你命令把他未洗的头颅扔给乌鸦, 把
他的尸体扔进海里. ]],
      },
      leader_first = {
         synopsis = "[%lC需要有人领导%lj武士对抗%n. 你准备好了吗? ]",
         output = "text",
         text = [["啊, %p桑, 很高兴再次见到你. 我需要一个能
领导我的武士对抗%n的人. 如果你准备好了, 你就会是
那个人. \"]],
      },
      leader_last = {
         synopsis = "[离开, 不要再回来. ]",
         output = "text",
         text = [["你不再是我的武士了, %p.

\"你的切腹被拒绝. 你被命令剃光头发, 然后
成为一名僧侣. 你的封地和家族被没收. わかりますか? \"]],
      },
      leader_next = {
         text = [["又一次, %p桑, 你跪在我面前. 你还有能力
做我的附庸吗? \"]],
      },
      leader_other = {
         synopsis = "[你真的是武士吗? ]",
         output = "text",
         text = [["你开始考验我的耐心了, %p桑.
如果你不能判断我想要一个武士具备什么, 我怎么能指望你
想出一个武士需要什么呢? \"]],
      },
      locate_first = {
         text = [[你本能地伸手去拿你的剑. 你不认识
这片土地的布局, 但你知道你的敌人无处不在. ]],
      },
      locate_next = {
         text = [[庆幸你%H的%sp看不到
你的恐惧, 你再次准备前进. ]],
      },
      nemesis_first = {
         text = [["啊, 所以是你, %p桑. 我提议你切腹.
如果你愿意, 我愿意做你的介错. \"]],
      },
      nemesis_next = {
         text = [["我已经向你提供了体面的退出方式. 现在我会
把你的头不洗就送给%l. \"]],
      },
      nemesis_other = {
         text = "\"在我把你打发走之后, 我会诅咒你的神. \"",
      },
      nemesis_wantsit = {
         text = [["你和我的武士战斗过; 你一定知道
你不可能把%o带回
%H.\"]],
      },
      nexttime = {
         text = "又一次, 你回到了%H.",
      },
      offeredit = {
         synopsis = "[天皇希望你带上%o去找回护身符. ]",
         output = "text",
         text = [[当你向%l鞠躬时, 他欢迎你:

    \"你为你的家族带来了巨大的荣誉, %pさま.

    \"你不在的时候, 天皇的大纳言在古代
    文献中发现, 寻找
    护身符的武士的业和%o的业是联系在一起的,
    就像四季结合成一年一样.

    \"因为你表现出了如此忠诚, 天皇请求
    你放下其他义务, 继续走在
    命运为你铺设的道路上. 如果你能允许我
    在你带着护身符回来之前照看你的家庭,
    我将感到荣幸. \"

说完, %l鞠躬, 并把他的剑放在
%o上面. ]],
      },
      offeredit2 = {
         synopsis = "[带上%o, 回到%Z, 找回护身符. ]",
         output = "text",
         text = [[%l紧紧地握着%o片刻, 然后把目光
转回你身上.

\"时机已到, 可以找回护身符了. 通过
将你传送到这里的魔法传送门回到%Z,
以便你能实现等待你的命运. \"]],
      },
      othertime = {
         synopsis = "[%HC受到%n的威胁. ]",
         output = "text",
         text = [[你回到了%H.

你立刻感觉到你的业力发生了微妙的变化. 你似乎知道
如果你不完成任务, %n就会在你再次回来之前
摧毁%H的神. ]],
      },
      posthanks = {
         text = "%lC鞠躬. \"%pさま, 告诉我们你寻找护身符的进展. \"",
      },
   },
   Tou = {
      assignquest = {
         synopsis = "[进入%i并从%n那里取回%o. ]",
         output = "text",
         text = [["你确实已经证明了自己是一个值得尊敬的%c, %p.

\"但现在, 你的亲属和我必须请求你放下你的旅行,
帮助我们度过难关. 你离开后, 我们选出了一位新市长,
%n. 他证明了自己是一个最令人发指和邪恶的生物.

\"上任后不久, 他就带着%o
潜逃出镇, 留下他的爪牙统治我们. 为了
我们能够重新控制我们的城镇, 你必须进入%i
并取回%o.

\"不要在任务中分心. 如果你不尽快回来, 我担心
一切都会失去. 现在让我们一起祈祷, 愿%d指引你
并保护你的安全. \"]],
      },
      badalign = {
         synopsis = "[你不够%a. 等你够格了再回来. ]",
         output = "text",
         text = [["让一个不忠于%a道路的人去承担她的
使命, 这将是对%d的侮辱.

\"你必须回到我们身边, 直到你清除了这些对你行为的
不良影响. 记住, 只有遵循%a的道路,
你才能希望克服你将面临的障碍. \"]],
      },
      badlevel = {
         synopsis = "[等你成为%Ra后再回来. ]",
         output = "text",
         text = [["你还有很多东西要学, 才能承担
下一步. 作为proven %R回到我们身边, 也许到那时
你就会准备好了.

\"回去吧, 愿%d的教导对你有所助益. \"]],
      },
      discourage = {
         "\"我打败了%l, 我也会打败你, %p. \"",
         "\"%d现在在哪里! 你必须意识到这里没人能帮你. \"",
         "\"现在求饶吧, 我也许会对你宽容点. \"",
         "\"如果你不那么%a, 你也许还有机会. \"",
         "\"复仇终于属于我了, %p. \"",
         "\"我只希望%l能派个更有价值的%r来对付我. \"",
         "\"有了%o在我手中, 你别想打败我. \"",
         "\"%nC从未被击败过, 从未! \"",
         "\"你真的是%H能派来对付我的最好的人吗? 我可怜%l. \"",
         "\"你怎么拼写%p? 我想确保你墓碑上的标记是正确的, 作为对你%sp的警告. \"",
      },
      encourage = {
         "\"不要被%n的虚假承诺愚弄. \"",
         "\"要进入%i, 你必须经过许多陷阱. \"",
         "\"如果你不带%o回来, 你的任务就白费了. \"",
         "\"如果你真的需要帮助, 不要害怕呼唤%d. \"",
         "\"如果你不摧毁%n, 他会跟着你回到这里! \"",
         "\"从%n那里拿走%o, 你也许就能打败他. \"",
         "\"你必须快点, %p! \"",
         "\"你对我来说就像%Sa, %p. 不要让我失望. \"",
         "\"如果你始终保持%a, 你也许能成功, %p. \"",
         "\"让你旅途中遇到的每个人都知道你在为%l执行任务, 并给予安全通行. \"",
      },
      firsttime = {
         synopsis = "[你发现自己回到了%H, 但寂静令人不安. ]",
         output = "text",
         text = [[当你发现自己回到%H熟悉的环境中时,
你松了口气.

你很快注意到, 事情看起来不像你离开时的样子.
小镇黑暗而安静. 镇墙后面没有声音传出,
田野里也没有篝火在燃烧. 事实上, 你根本
%x不到田野里有任何动静, 庄稼似乎已经
好几周没人照料了. ]],
      },
      goal_alt = {
         text = "你已经回到了%n的巢穴.",
      },
      goal_first = {
         text = "你感觉到%o的存在.",
      },
      goal_next = {
         text = [[你获得信心, 知道你可能很快就会与
%o团聚. ]],
      },
      gotit = {
         synopsis = "[你拿起%o感到解脱. 把它还给%l. ]",
         output = "text",
         text = [[当你拿起%o时, 你感觉到一个巨大的
负担已经从你的肩膀上卸下. 你唯一的想法是
赶快回到%H并找到%l. ]],
      },
      guardtalk_after = {
         "\"每天5zorkmid在地狱--如果你问我, 更像是每天500. \"",
         "\"你知道哪里可以找到侏儒矿坑的好明信片吗? \"",
         "\"你试过奇怪的厕所吗? \"",
         "\"如果你留下来, 我会给你看我最近旅行的照片. \"",
         "\"你给我带纪念品了吗? \"",
      },
      guardtalk_before = {
         "\"每天5zorkmid在地狱--如果你问我, 更像是每天500. \"",
         "\"你知道哪里可以找到侏儒矿坑的好明信片吗? \"",
         "\"你试过奇怪的厕所吗? \"",
         "\"别住在客栈, 我听说食物很糟糕而且有老鼠. \"",
         "\"他们告诉我这是淡季! \"",
      },
      hasamulet = {
         synopsis = "[你有了护身符. 把它带到星界去完成你的任务. ]",
         output = "text",
         text = [["退后, 让我看看你, %p.
既然你已经找回了岩德的护身符, 恐怕在%H
度过余生会显得很平淡.

\"你已经走了太远, 不能现在停下来, 因为我们的口述历史
还预言了更多任务. 然而, 从今以后, 你的名字将永远
被%gP们怀着敬畏念诵. 你真正成为了是你的%sp
的鼓舞! \"]],
      },
      killed_nemesis = {
         synopsis = "[%nC在你%nh死时诅咒你. ]",
         output = "text",
         text = [[你转向%n的方向. 当%nh的肉身身体开始
在你眼前消失时, 你听到他诅咒道:

    \"你永远摆脱不了我, %p!
    无论你走到哪里, 我都会找到你, 夺回真正属于我的东西. \"]],
      },
      leader_first = {
         synopsis = "[必须有人打败%n. 你准备好了吗? ]",
         output = "text",
         text = [["真是你吗, %p! 我对你的归来已经不抱希望了.
正如你所%x, 我们急需你的才能. 必须有人
打败%n, 我们的城镇才能恢复原貌.

\"让我看看你是否准备好成为那个人. \"]],
      },
      leader_last = {
         synopsis = "[离开%H, 永远不要回来. ]",
         output = "text",
         text = [["太迟了, %p. 你甚至不配死在我们中间.
离开%H, 永远不要回来. \"]],
      },
      leader_next = {
         text = "\"情况越来越糟, %p. 我希望这次你准备好了. \"",
      },
      leader_other = {
         text = "\"为了%H的利益, 我希望你这次已经准备好了. \"",
      },
      locate_first = {
         synopsis = "[你%x到%n的爪牙们的手艺. ]",
         output = "text",
         text = [[只有你对%d的信仰让你不至于发抖. 你%x到
%n的爪牙的手艺无处不在. ]],
      },
      locate_next = {
         text = "你知道这次必须找到并摧毁%n.",
      },
      nemesis_first = {
         synopsis = "[%rA不会打败我. ]",
         output = "text",
         text = [["那么, %p, %l认为你可以从
我手中夺取%o!

\"这只能证明他已经绝望到了极点, 竟然派%ra来
试图打败我. 今天结束后, 我会让你在
矿井里当奴隶, 在那里你会后悔进入
%i的那一天. \"]],
      },
      nemesis_next = {
         text = [["上次我让你活下来是因为它给了我快乐.
这次我会摧毁你, %p. \"]],
      },
      nemesis_other = {
         synopsis = "[快跑, 否则你会受到严重折磨. ]",
         output = "text",
         text = [["这些会面开始让我厌烦. 你干扰了我用
%o的工作.

\"如果你现在不跑开, 我会让你遭受如此多的痛苦, 以至于
%l会因为曾经把他的%S送到我这里而感到内疚! \"]],
      },
      nemesis_wantsit = {
         synopsis = "[\"把%o还给我, 我们将统治%H. \"]",
         output = "text",
         text = [["你这个傻瓜. 你不知道如何调用
%o的力量.

\"把它还给我, 我会教你如何使用它, 我们一起
将统治%H. 但现在就做, 因为我的耐心正在消逝. \"]],
      },
      nexttime = {
         text = "又一次, 你回到了%H.",
      },
      offeredit = {
         synopsis = "[带上%o, 在%d的指引下, 找回护身符. ]",
         output = "text",
         text = [[当%l察觉到%o的存在时,
他几乎第一次露出了多个月来的微笑.

当他从%o上抬起头时, 他说道:

    \"你已经找回了%o. 你现在是它的
    拥有者, 但不是它的主人. 让它与你合作, 继续
    你的旅程. 在它的帮助下, 以及%d在%a道路上
    指引你, 你也许还能找回岩德的护身符. \"]],
      },
      offeredit2 = {
         synopsis = "[保留%o, 通过传送门回到%Z. ]",
         output = "text",
         text = [["%oC现在是你的了. %Z
正等待你通过带你来到这里的魔法传送门返回. \"]],
      },
      othertime = {
         text = [[你回到了%H.
情况似乎变得如此糟糕, 以至于你担心
%H很快就会不复存在. ]],
      },
      posthanks = {
         text = [["我为你感到再骄傲不过了, 就好像你是我自己的%S一样, %p!
告诉我你寻找岩德护身符的冒险经历. \"]],
      },
   },
   Val = {
      assignquest = {
         synopsis = "[找到%i; 击败%n; 带着%o回来. ]",
         output = "text",
         text = [["我不清楚, %p, 因为没有了我们的圣物, 我的视野有限.
但现在你很可能可以击败%n, 并找回
%o.

\"不久前, %n和他的仆从袭击了这里. 他们打开了
你%x到的山丘周围巨大的火山口, 然后发动了攻击. 我知道
这会到来, 并已经向%d祈求一队%gP
来帮助保卫这个地方. 你%x到的少数人是
英灵殿最强大的战士, 是%d派来的一百人中的
幸存者.

\"尽管我们打了伟大而光荣的仗, %n最终还是设法
偷走了%o. 这打破了宇宙的平衡,
除非%oh归还到我的手中, 否则%n可能会引发诸神黄昏.

\"你必须找到通往%i的入口. 从那里
向下走, 你会找到%n的巢穴. 打败他,
并把%o还给我. \"]],
      },
      badalign = {
         synopsis = "[你已经偏离了%a之路. 等你净化自己后再回来. ]",
         output = "text",
         text = [["*不*! 这太糟糕了. 我看到你正成为%n的盟友,
并在最后的伟大战斗中领导他的军队. 这绝不能
发生! 你已经偏离了%a之路. 你必须净化自己,
只有当你恢复了纯洁状态后才能回到这里. \"]],
      },
      badlevel = {
         synopsis = "[等你成为%Ra后再回来. ]",
         output = "text",
         text = [["我看到你和%n在战斗, %p. 但你还没有准备好,
如果你继续, 就会死在%n手中. 不. 这样不行.
回到外面的世界去, 在战争之道上增长经验.
只有当你作为%Ra回来之后, 你才能打败%n. \"]],
      },
      discourage = {
         "\"我是你的死神, %c. \"",
         "\"你无法获胜, %r. 我预见了你的每一步. \"",
         "\"除掉了你, 英灵殿就是我的囊中之物. \"",
         "\"我夺取%o时杀死了成群的%d最优秀的战士. 你真的认为区区%c能对抗我吗? \"",
         "\"是谁将%cP的灵魂带到英灵殿, %r? \"",
         "\"不, %d在这里帮不了你. \"",
         "\"你是%d的什么工具, %p. 你是个弱者! \"",
         "\"我从未见过%ca在战斗中如此笨拙. \"",
         "\"你现在死吧, 小%s. \"",
         "\"我现在摧毁你的身体, 等我的部落攻占英灵殿时再摧毁你的灵魂! \"",
      },
      encourage = {
         "\"带着%d的祝福去吧. \"",
         "\"当你需要的时候呼唤%d. \"",
         "\"如果可以的话, 使用%o. 它会保护你. \"",
         "\"魔法寒冷对%n非常有效. \"",
         "\"要面对%n, 你需要对火焰免疫. \"",
         "\"愿%d强化你的持剑手臂. \"",
         "\"相信%d. 他不会抛弃你. \"",
         "\"随着每一刻的流逝, 诸神黄昏越来越可能到来. 你必须快点, %p. \"",
         "\"如果%n能掌控%o, 他将强大到足以比命运预定的更早面对%d. 这绝不能发生! \"",
         "\"记住你的训练, %p. 你能成功. \"",
      },
      firsttime = {
         synopsis = "[你到达%H的下方. 有些不对劲; 这里有熔岩. ]",
         output = "text",
         text = [[你显现在一个积雪山丘的底部. 山丘顶部坐落着
你熟悉的地方, %H. 你立刻意识到
这里出了大问题!

有些地方的雪和冰融化成冒着热气的
水池. 冒烟的喷气孔和冒泡的熔岩池环绕着山丘.
空气中弥漫着硫磺的恶臭, 你%x到不应该
在这种环境中生存的生物向你移动. ]],
      },
      goal_first = {
         synopsis = "[这是%n的巢穴. ]",
         output = "text",
         text = [[透过硫磺气体的云层, 你%x到一个岩石栅栏,
周围环绕着一条冒着泡的熔岩护城河. 你记得%l
说过的话中的描述. 这就是%n的巢穴. ]],
      },
      goal_next = {
         text = "又一次, 你站在%n巢穴的视线内.",
      },
      gotit = {
         synopsis = "[你必须把%o还给%l. ]",
         output = "text",
         text = [[当你拿起%o时, 你的脑海中突然充满了图像,
你感知到了每个潜在选择的所有可能性. 当你开始
控制和引导你的思绪时, 你意识到
必须立即把%o还给%l. ]],
      },
      guardtalk_after = {
         "\"万岁, 幸会, 勇敢的%c. \"",
         "\"愿%d指引你的脚步, %p. \"",
         "\"%lC告诉我们你成功了! \"",
         "\"你及时找回了%o, %p. \"",
         "\"赞美%d, 因为他把%o归还给了我们. \"",
      },
      guardtalk_before = {
         "\"万岁, 幸会, 勇敢的%c. \"",
         "\"愿%d指引你的脚步, %p. \"",
         "\"%lC在变弱. 没有了%o, 她的远见是模糊的. \"",
         "\"你必须快点, %p, 否则诸神黄昏很可能会来. \"",
         "\"我会亲自对付这个该死的%n, 但%d禁止这样做. \"",
      },
      hasamulet = {
         synopsis = "[把护身符带到星界%d的神殿并献上它. ]",
         output = "text",
         text = [["太好了, %p. 我看到你找回了护身符!

\"你必须把护身符带到星界位面的%d大神殿.
在那里, 你必须把护身符献给%d.

\"现在走吧, 我的%S. 我无法告诉你你的命运, 因为
护身符的力量干扰了我的力量. 我祝愿你成功. \"]],
      },
      killed_nemesis = {
         synopsis = "[%nC死了. ]",
         output = "text",
         text = [[%n的脸上出现了惊讶和恐惧的神色.

    \"不!!! %o骗了我! 我被误导了! \"

突然, %n抓住自己的头, 痛苦地尖叫着, 然后死了. ]],
      },
      leader_first = {
         synopsis = "[我们需要你的帮助. 你准备好了吗? ]",
         output = "text",
         text = [["啊, %p, 我的%S. 你终于回到%H
了. 我们急需你的帮助, 但我必须确定你是否
已经准备好承担这样的任务.

\"让我读出你的命运... \"]],
      },
      leader_last = {
         synopsis = "[\"离开我的视线, 永远不要回来. \"]",
         output = "text",
         text = [["不, %p. 你的命运已定. 我必须另寻
勇士. 离开我的视线, 永远不要回来. 要知道,
你这辈子永远不会成功, 英灵殿也向你关闭. \"]],
      },
      leader_next = {
         text = [["现在让我为你读出未来, %p, 也许你已经设法
改变了它足够... \"]],
      },
      leader_other = {
         text = [["我将再次读出你的命运, 我的%S. 让我们都希望你已经
做出了改变, 准备好了这个任务... \"]],
      },
      locate_first = {
         synopsis = "[这是通往%i的入口. ]",
         output = "text",
         text = [[冰雪让位给一片谷底. 你%x到前方
一个巨大的圆形山丘, 被熔岩池包围. 那么这就是通往
%i的入口. 看起来你若不战斗是进不去的. ]],
      },
      locate_next = {
         text = "又一次, 你站在通往%i的入口前.",
      },
      nemesis_first = {
         synopsis = "[\"%oC告诉我必须杀了你. \"]",
         output = "text",
         text = [["那么! %lC终于派了%ca来挑战我!

\"我以为掌控%o能让我挑战
%d, 但它告诉我, 首先我必须杀了你! 所以来吧, 小
%s. 一旦我打败你, 我终于可以开始与%d的最终战斗. \"]],
      },
      nemesis_next = {
         text = "\"你又来挑战我, %r. 很好. 我现在就杀了你. \"",
      },
      nemesis_other = {
         text = "\"你还没学会吗? 你无法打败%n! \"",
      },
      nemesis_wantsit = {
         text = "\"我会杀了你, %c, 并从你残缺的手中夺走%o. \"",
      },
      nexttime = {
         text = "又一次, 你靠近%l的住所.",
      },
      offeredit = {
         synopsis = "[带上%o. 寻找护身符. ]",
         output = "text",
         text = [[当你走近时, %l站起来, 触摸%o.

\"你可以带上%o, %p. 我已经从中移除了
预测未来的力量, 因为那种力量不应由凡人拥有.
然而, 它的其他能力, 你可以使用.

\"你现在必须以%d的名义开始寻找岩德的护身符.
愿%d指引你的脚步, 我的%S. \"]],
      },
      offeredit2 = {
         synopsis = "[你现在是%o的守护者了. 通过传送门返回, 找到护身符. ]",
         output = "text",
         text = [["小心, %p! %oC可能会碎, 那将是
一个悲剧性的损失. 你现在是它的守护者, 是时候
继续寻找护身符了. %Z正等待你
通过带你来到这里的魔法传送门返回. \"]],
      },
      othertime = {
         text = [[你再次显现在%l的住所附近. 你有一种唠叨的感觉,
这可能是你最后一次来这里了. ]],
      },
      posthanks = {
         text = [["你好, %p. 我一直没能像我希望的那样
多关注你寻找护身符的任务. 你过得怎么样? \"]],
      },
   },
   Wiz = {
      assignquest = {
         synopsis = "[前往%i; 击败%n; 带着%o回来. ]",
         output = "text",
         text = [["是的, %p, 你真正准备好了迎接这个可怕的任务. 仔细
听, 因为我现在告诉你的将至关重要.

\"自从你离开我们去世上磨练技能以来, 我们出乎意料地
遭到了%n势力的攻击. 正如你所知, 我们以为
%n在上个时代结束时已经死了, 但是, 唉, 事实并非如此.

\"%nC派了一支可憎之物军队攻击我们. 其中有一个
仆从, 没有灵魂, 被魔法控制, 因此, 在混乱中, 它得以
穿透我们的防御. 唉, 这个生物偷走了
%o, 我担心已经把它交给了%n.

\"多年来, 我把大部分力量都编织进了这个护身符, 因此,
没有了它, 我只剩下昔日力量的一个影子, 我担心
我很快就会死去.

\"你必须前往%i, 并在其地牢中,
找到并击败%n, 然后把%o还给我.

\"现在带着%d走吧, 趁还来得及, 完成这个任务. \"]],
      },
      badalign = {
         synopsis = "[走吧; 等你配得上%d了再回来. ]",
         output = "text",
         text = [["你让我惊讶, %p! 我告诉过你多少次, 法师之道
是一条苛刻的道路. 一个人必须小心使用世界, 以免
留下废墟, 给%n的任务简化.

\"你必须回去证明你的价值. 在你真正准备好
这个任务之前不要回来. 愿%d在这个任务中指引你. \"]],
      },
      badlevel = {
         synopsis = "[走吧; 等你成为%Ra后再回来. ]",
         output = "text",
         text = [["唉, %p, 你还没有证明你作为称职
施法者的本领. 作为%ra, 你肯定会在
前方的挑战中被击败. 现在走吧, 拓宽你的视野, 等你
作为%Ra获得了声望后再回来. \"]],
      },
      discourage = {
         "\"你可怜的力量不是我的对手, 傻瓜! \"",
         "\"当你被击败后, 你的折磨将持续一千年. \"",
         "\"在你失败之后, %p, 我会把%l当甜点吃掉! \"",
         "\"你准备好求饶了吗? 我可以宽容一点... \"",
         "\"你的灵魂将加入我指挥的众多受奴役者! \"",
         "\"你缺乏意志是显而易见的, 你会因此而死. \"",
         "\"你对%d的信仰是徒劳的! 来吧, 现在顺从我! \"",
         "\"区区%r与我的技能相比不值一提! \"",
         "\"那么, 你就是%l最大的希望? 多么可笑. \"",
         "\"感受我的力量, %c! 我的胜利就在眼前! \"",
      },
      encourage = {
         "\"小心, %n对大多数魔法攻击免疫. \"",
         "\"要进入%i, 你必须经过许多陷阱. \"",
         "\"%nC可能容易受到物理攻击. \"",
         "\"当你呼唤时, %d会来帮助你. \"",
         "\"你必须彻底摧毁%n. 否则他会追杀你. \"",
         "\"%oC是一件强大的神器. 有了它你可以摧毁%n. \"",
         "\"带着%d的祝福前进吧. \"",
         "\"我会让我的%gP们留意你的归来. \"",
         "\"随意拿那个箱子里任何可能帮助你的物品. \"",
         "\"当%o靠近时你会知道. 小心行事! \"",
      },
      firsttime = {
         synopsis = "[你已经到达%l的塔, 但有些非常不对劲. ]",
         output = "text",
         text = [[你突然置身于熟悉的环境中. 你注意到附近似乎有一个
大型, 矮胖的石头结构. 等等! 那看起来像你以前的老师%l
的塔.

然而, 事情和你上次来这里时不一样了. 塔的周围
笼罩着迷雾和无法解释的黑暗区域. 阴影中有
动静.

你的老师绝不会允许这样不美观的形式围绕
塔... 除非有什么非常糟糕的事情发生了! ]],
      },
      goal_alt = {
         text = "你已经回到了%n的巢穴.",
      },
      goal_first = {
         text = "你感觉到你的导师的存在; 也许%o就在附近.",
      },
      goal_next = {
         text = "%o的光晕在你的感知边缘刺痛.",
      },
      gotit = {
         synopsis = "[你感觉到%o的力量, 知道你应该把%oh还给%l. ]",
         output = "text",
         text = [[当你触摸%o时, 它令人舒适的力量为你注入
新的能量. 你感觉仿佛可以通过它感知到他人的思想
流动. 尽管你渴望戴着%o去
攻击岩德的巫师, 但你知道必须把它归还给真正的
主人%l. ]],
      },
      guardtalk_after = {
         "\"我有一些蝾螈眼可以交易, 你有多余的盲蛇的毒刺吗? \"",
         "\"现在魔法传送门似乎会稳定相当长一段时间. \"",
         "\"你有没有注意到自从%o被找回后, %l变得多强? \"",
         "\"感谢%d! 我们不确定你能打败%n. \"",
         "\"我也将进入世界, 因为%n只是需要被征服的众多邪恶之一. \"",
      },
      guardtalk_before = {
         "\"你那个塞得满满的背包里碰巧有眼球吗, %s? \"",
         "\"啊, 创造魔法传送门的法术成功了. 太棒了! \"",
         "\"快点! %lC可能撑不过那个传送门法术的施放! \"",
         "\"%n的法术对我们来说太强大了, 我们无法抵挡. \"",
         "\"我也将进入世界, 因为%n只是需要被征服的众多邪恶之一. \"",
      },
      hasamulet = {
         synopsis = "[把护身符带到星界%d的祭坛上. ]",
         output = "text",
         text = [["恭喜, %p. 我一直认为, 如果有人能成功
击败岩德的巫师和他的仆从, 那一定是你.

\"现在走吧, 把护身符带到星界位面. 到了那里,
把护身符呈现在%d的祭坛上. 沿途你会穿过
四个元素位面. 这些位面与你以往经历过的
任何东西都不同, 所以做好准备!

\"你生来就是为了这个, %s! 我为你感到非常骄傲. \"]],
      },
      killed_nemesis = {
         synopsis = "[%nC在你%nh死时诅咒你. ]",
         output = "text",
         text = [[%nC, 他的身体开始萎缩, 用沙哑的声音说:

    "我会纠缠你的征途直到时间尽头. 一千个
    诅咒落在你和%l身上."

然后, 身体爆成一团令人窒息的灰尘, 吹走了. ]]
      },
      leader_first = {
         synopsis = "[你走了很远的路, 但你准备好接受我要求的任务了吗? ]",
         output = "text",
         text = [["靠近点, %p, 因为我的声音在晚年变得虚弱.
是的, 我看到自从你离开这座塔的安全范围进入世界以来,
你已经走了很远. 然而, 我必须首先确定你是否拥有
承担我要求的任务所需的所有技能. \"]],
      },
      leader_last = {
         synopsis = "[\"滚出去! \"]",
         output = "text",
         text = [["你这个傻瓜, %p! 我为什么要浪费那些年教你
那些深奥的arts? 滚出去! 我会另找别人. \"]],
      },
      leader_next = {
         text = "\"好吧, %p, 你回来了. 也许你现在准备好了... \"",
      },
      leader_other = {
         text = [["这变得很麻烦, %p, 但毅力是真正的魔法师的标志.
我确实希望你这次真正准备好了! \"]],
      },
      locate_first = {
         text = "附近有模糊的雾. 你感觉%n的巢穴很近了.",
      },
      locate_next = {
         text = "你相信你可能会再次入侵%i.",
      },
      nemesis_first = {
         synopsis = "[\"你的毁灭应该能带来好的娱乐. \"]",
         output = "text",
         text = [["啊, 我认出你了, %p. 那么, %l派你来从
我这里偷%o, 嗯? 嗯, %lh是个傻瓜, 竟然派这样一个
多愁善感的弱者来对付我.

\"然而, 你的毁灭应该能带来好的娱乐. 到最后, 你会
求我杀了你! \"]],
      },
      nemesis_next = {
         synopsis = "[\"你的灵魂很快就会归我指挥. \"]",
         output = "text",
         text = [["你能回来真是太好了, %p! 我很享受我们上次的会面. 你还
渴望更多痛苦吗?

\"来吧! 你的灵魂, 就像%o一样, 很快就会归我指挥. \"]],
      },
      nemesis_other = {
         text = [["我确信你的毅力将成为无数
歌谣的主题, 但恐怕你无法活着听到它们了! \"]],
      },
      nemesis_wantsit = {
         text = [["贼! %oC现在属于我了. 我会把你的
活肉喂给我的仆从. \"]],
      },
      nexttime = {
         text = "又一次, 你回到了%H.",
      },
      offeredit = {
         synopsis = "[在你寻找护身符的任务中带上%o. ]",
         output = "text",
         text = [[%lC注意到你手中的%o,
对你微笑并说道:

    \"我就知道你能打败%n并取回
    %o. 我们永远不会忘记这
    勇敢的服务.

    \"在你寻找岩德护身符的任务中带上%oh.
    我能感觉到%o%oiself已经同你调谐.

    \"愿%d在你任务中指引你, 并保护你免受伤害. \"]],
      },
      offeredit2 = {
         synopsis = "[保留%o, 通过传送门回到%Z; 找到另一个护身符. ]",
         output = "text",
         text = [["你现在是%o的守护者了. 是时候
去取回 /另一个/ 护身符了. %Z正等待你通过
带你来到这里的魔法传送门返回. \"]],
      },
      othertime = {
         text = [[你回到了%H.
你有一种奇怪的感觉, 这可能是你最后一次来这里. ]],
      },
      posthanks = {
         text = [["靠近点, 我的%S, 和我分享你的冒险经历.
那么, 你寻找岩德护身符的任务成功了吗? \"]],
      },
   },
}